Repository: pyconsk/2020.pycon.sk
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: sk

source: See the <a href="http://pyvideo.org">http://pyvideo.org</a> for one such venue.
sk: Pozri si <a href="http://pyvideo.org">http://pyvideo.org</a> na podobnom mieste.

source: By submitting your talk or workshop proposal, or by signing up to give a lightning talk, you agree to give permission to SPy o.z. to record, edit, and release the audio and/or video of your presentation.
sk: Odoslaním návrhu na prednášku alebo workshop alebo zapísaním sa na lightning talk dávaš súhlas SPy o.z. na nahrávanie, úpravu a zverejnenie audio a/alebo video záznamu z tvojej prezentácie.

source: We might also perform interviews with poster presenters or attendees and require recording releases to publish them.
sk: Taktiež môžeme robiť rozhovory s autormi/autorkami posterov alebo návštevníkmi/návštevníčkami a vyžiadať si povolenie na ich zverejnenie.

source: By default, the recording release checkbox is checked when submitting a proposal. If you wish to opt-out, uncheck the release checkbox, note that no recordings or live stream of your talk will be made. You cannot opt out of recording for lightning talks.
sk: Pri odosielaní návrhu je súhlas so zverejnením predvolene zapnutý. Ak si želáš nezverejňovať nahrávku, odznač checkbox. V takom prípade sa z tvojej prednášky nebude robiť záznam ani živé streamovanie. V prípade lightning talku nie je možné odmietnuť zverejnenie.

source: You agree to the following legalese, which certifies that you are the author of your presentation (or otherwise allowed to present it at PyCon), and which allows SPy o.z. 1) to perform the necessary audio and video editing needed to prepare your presentation, and 2) to distribute the recordings to other people, including on YouTube, or video sites. Released under the CC-BY license. It also allows other people to watch the recordings.
sk: Súhlasíš s nasledujúcou zmluvou, ktorá zabezpečuje, že si autorom alebo autorkou svojej prezentácie (alebo máš oprávnenie zverejniť ju na konferencii PyCon SK) a ktorá povoľuje SPy o.z. 1) vykonávať potrebné audio a video úpravy pri príprave tvojej prezentácie a 2) distribuovať nahrávky ďalším ľuďom, vrátane YouTube alebo iných video stránok. Zverejnené pod licenciou CC-BY. Taktiež umožňuje ostatným ľuďom sledovať tieto nahrávky.

source: Legalese
sk: Zmluva

source: I certify that I, the Submitter, am authorized to license this proposal and its associated presentation (the "User Submission") to SPy o.z. for use in association with PyCon SK 2019.
sk: Potvrdzujem, že ja, Prispievateľ(ka), som oprávnený/-á poskytnúť licenciu na tento návrh na prednášku a príslušnú prezentáciu ("Príspevok") pre SPy o.z. na využitie v súvislosti s konferenciou PyCon SK 2019.

source: Specifically
sk: Konkrétne

source: I, the Submitter, certify that I am the creator (and own the copyright) of the User Submission.
sk: Ja, Navrhovateľ(ka), potvrdzujem, že som autor(ka) (a vlastník/-čka copyrightu) Príspevku.

source: I, the Submitter, hereby grant SPy o.z. the permission to publish the User Submission and its audio/video recordings under the CC-BY license.
sk: Ja, Navrhovateľ(ka), týmto povoľujem SPy o.z. zverejniť Príspevok a jeho audio/video nahrávky pod CC-BY licenciou.

source: I, the Submitter, specifically affirm the right to perform the User Submissions on SPy o.z. web sites or on other web sites designated by the PSF (including, but not necessarily limited to YouTube).
sk: Ja, Navrhovateľ(ka), potvrdzujem najmä súhlas so zverejnením Príspevku na webstránkach SPy o.z. alebo na ďalších web stránkach určených PSF (vrátane, ale nie nutne výlučne YouTube).

source: Slovak language
sk: Slovenský jazyk

source: English language
sk: Anglický jazyk

source: Czech language
sk: Český jazyk

source: Our sponsors
sk: Naši sponzori

source: Our sponsors and partners
sk: Naši sponzori a partneri

source: We would be probably not able to make this event happen without support of our generous sponsors.
sk: Túto konferenciu by sme neboli schopní zorganizovať bez podpory našich štedrých sponzorov.

source: Check who made this event possible!
sk: Pozri, vďaka komu sa podarilo zorganizovať túto konferenciu.

source: Diamond sponsor
sk: Diamantový sponzor

source: Platinum sponsors
sk: Platinoví sponzori

source: Gold sponsors
sk: Zlatí sponzori

source: Silver sponsors
sk: Strieborní sponzori

source: Bronze sponsors
sk: Bronzoví sponzori

source: Main media partner
sk: Hlavný mediálny partner

source: Partners
sk: Partneri

source: Thank You
sk: Ďakujeme

source: We'll get in touch as soon as possible.
sk: Ozveme sa čo najskôr

source: You can also buy tickets directly on the <a class="external" href="https://ti.to/pyconsk/pyconsk-2020" target="_blank">https://ti.to/pyconsk/pyconsk-2020</a> website in case the tito widget is not displayed correctly.
sk: Lístky si môžeš kúpiť aj priamo na webstránke <a href="https://ti.to/pyconsk/pyconsk-2020" target="_blank">https://ti.to/pyconsk/pyconsk-2020</a>, ak sa ti tito widget nezobrazuje správne.

source: What am I paying for?
sk: Za čo platím?

source: The conference takes place at the Faculty of Informatics and Information Technologies (Slovak University of Technology)
sk: Konferencia sa koná na Fakulte informatiky a informačných technológií (Slovenskej technickej univerzity)

source: Venue is in new building and have well equipped and pleasant auditoriums and lobbies. The first PyCon SK was one of the first conferences in this auditorium!
sk: Miesto konania je v novej budove, ktorá má príjemné a dobre vybavené prednáškové miestnosti a príslušné priestory. Prvý PyCon SK bol jednou z prvých konferencií v týchto priestoroch!

source: Speakers and Lecturers
sk: Rečníci a rečníčky

source: Our speakers are the best. And they do it for free! However, we have to pay for their conference ticket and sometimes we cover the travel budget.
sk: Naši rečníci a rečníčky sú najlepší. A robia to zadarmo! Platíme im však vstupenky a niekedy im preplatíme cestovné náklady.

source: Expenses for flight tickets and hotel in Bratislava are a big part of our budget. We also cover all the costs of recording and releasing all of the talks.
sk: Výdavky za letenky a ubytovanie v bratislavských hoteloch tvoria veľkú časť nášho rozpočtu. Taktiež znášame všetky náklady súvisiace so záznamom a zverejnením všetkých príspevkov.

source: Community & Inclusion
sk: Komunita a inklúzia

source: PyCon is a special type of conference - it is organised by the community for the community
sk: PyCon je špeciálna konferencia - je organizovaná komunitou pre komunitu

source: By attending, you have a chance to meet like minded people and hear a lot of interesting stories. However, for those who cannot afford to attend because of financial reasons we have opened a financial aid scheme and give free tickets.
sk: Ak sa zúčastníš konferencie, máš šancu stretnúť podobne naladených ľudí a vypočuť si množstvo zaujímavých príbehov. Pre tých, ktorí si z finančných dôvodov nemôžu dovoliť kúpiť lístok na konferenciu, sme pripravili program na podporu a máme pripravené určité množstvo lístkov zadarmo.

source: Conference T-shirt and other swag
sk: Tričko z konferencie a ďalšie drobnosti

source: What kind of conference would PyCon Slovakia be without a conference T-shirt?
sk: Čo by to bolo za konferenciu bez konferenčného trička?

source: Each attendee receives one 100&#37; cotton T-shirt and other swag. Possibly a water bottle--> <!-- with our fancy PyCon Slovakia logo. We would love to hear your ideas...
sk: Každý účastník dostane jedno 100&#37; bavlnené tričko a ďalšie drobnosti. Možno aj fľašu na vodu --> <!-- s našim skvelým PyCon SK logom. Privítame aj tvoje návrhy...

source: Refreshments
sk: Občerstvenie

source: Afraid of falling asleep during a talk? Don't worry, we have your back with our all-you-can-drink coffee, tea and water.
sk: Obávaš sa, že zaspíš počas prednášky? Už nemusíš, máme všetko - kávu, čaj či vodu.

source: We will have two professional baristas serving fresh coffee and tea all day long. Water fountains will be available on multiple spots in the lobby.
sk: Budeme mať dvoch profesionálnych baristov, ktorí vám počas celého dňa budú pripravovať čerstvú kávu alebo čaj. Zásobníky s vodou budú k dispozícii na viacerých miestach rovnomerne v celej lobby.

source: Lunch
sk: Obed

source: During all three days, a variety of warm food will be served for lunch
sk: Počas všetkých troch dní sa budú na obed servírovať rôzne teplé jedlá

source: Meat and vegetarian alternatives will be available.
sk: K dispozícii budú mäsité aj vegetariánske alternatívy

source: We also try to be as eco friendly as possible, and so we serve food on ceramic plates, eat with metal cutlery and drink water from reusable plastic bottles.
sk: Snažíme sa tiež byť čo možno najekologickejší, takže jedlo podávame na keramických tanieroch, jeme kovovým príborom a pitnú vodu poskytujeme z recyklovateľných plastových fliaš.

source: Real Conference Ticket Price
sk: Skutočná cena vstupenky

source: The <b>real price</b> of one conference ticket would be much higher had it not been for our sponsors and partners, thanks to whom we can afford to sell cheaper tickets.
sk: <b>Skutočná cena</b> vstupenky na konferenciu by bola oveľa vyššia, keby nás nepodporovali naši sponzori a partneri, vďaka ktorým môžeme lístky predávať oveľa lacnejšie.

source: Without sponsors and partners all tickets would cost over 90&euro; (including student and teacher tickets) and this price still does not include the enormous amount of volunteer work, which is done by the Python commnity before and during each PyCon.
sk: Bez sponzoringu a partnerov by lístky stáli vyše 90&euro; (vrátane študentských a učiteľských lístkov) a táto cena stále nezahŕňa obrovské množstvo dobrovoľníckej práce, ktorú robí Python komunita pred a počas každého PyConu.

source: Map and POIs
sk: Mapa

source: Travelling to Bratislava
sk: Cesta do Bratislavy

source: Bratislava is one of the youngest capitals in Europe, and also one of the smallest. Despite this, it has a rich history of a free royal coronation town of Pressburg and offers multiple opportunities how to spend time there. Bratislava has a unique location, it is the only capital in the world located on the border of three countries.Today, Bratislava is a major transport hub in Central Europe, and there are plenty possibilities of getting here.
sk: Bratislava patrí medzi najmladšie a tiež najmenšie hlavné mestá Európy. Napriek tomu má bohatú históriu slobodného kráľovského korunovačného mesta, kedy sa ešte nazývala Prešporok a mnoho možností, ako stráviť čas počas vašej návštevy mesta. Bratislava je unikátna svojou polohou, ako jediné hlavné mesto na svete sa nachádza na hranici troch štátov. Dnes je Bratislava významným dopravným uzlom v strednej Európe a možností, ako sa sem dostať, je neúrekom.

source: By air
sk: Letecky

source: If you are travelling to Bratislava, you can fly to the Bratislava airport (airport code: BTS) or the Vienna airport (airport code: VIE). The Vienna airport has considerably better offer of flights.
sk: Ak cestuješ do Bratislavy, môžeš letieť na bratislavské letisko (kód letiska: BTS) alebo na letisko Viedeň (kód letiska: VIE). Viedenské letisko má v porovnaní s bratislavským podstatne väčší výber letov.

source: From Bratislava airport you can take a taxi (use the phone, it's cheaper), or take the bus #61 and then change to bus #39 at the Bajkalska station. Get off the bus at the station ZOO and simply follow the PyCon stickers up to the hill to the university campus.
sk: Z bratislavského letiska môžeš ísť taxíkom (zavolaj si ho telefonicky, je to lacnejšie), prípadne môžeš ísť autobusom číslo 61 a na zástavke Bajkalská prestúp na autobus číslo 39. Linkou 39 sa odvezieš na zástavku ZOO, kde prichádzaš do cieľa. Ďalej už len nasleduj nálepky PyconSK smerom na kopec.

source: If you travel via Vienna airport, there are direct and cheap bus connections from early morning till midnight. One way ticket costs about 8 EUR and if you buy in advance, the ticket may be considerably cheaper. There are three airport shuttle buses between Vienna airport and Bratislava: SlovakLines (red buses), Blaguss (silver buses) and RegioJet (Yellow busses).
sk: Ak letíš do Viedne, medzi viedenským letiskom a Bratislavou premáva priame a cenovo dostupné autobusové spojenie každú hodinu od skorého rána až do neskorej noci - jednosmerná jazda stojí okolo 8 EUR, ak si zakúpiš lístok v predstihu môže byť výrazne lacnejší. Autobusovú prepravu prevádzkujú tri spoločnosti: SlovakLines (červené autobusy), Blaguss (strieborné autobusy), RegioJet (žlté autobusy). Týmito autobusmi sa dostaneš na hlavnú autobusovú stanicu Mlynské Nivy.

source: By car
sk: Autom

source: Arriving from Vienna, choose the direction Schwechat on A4 highway, then turn to highway A6 leading to Bratislava. After crossing the border you will soon enter Bratislava, then follow the direction Praha/Brno. Right after crossing the river of Danube leave the highway and follow the road along the highway. After several hundreds of meters you will get to the crossroad where you should turn left and cross the highway you have left a minute ago. After the bridge there is another crossroad where you turn right and immediately turn slightly left up the hill towards the university campus.
sk: Z Viedne smerom na letisko Schwechat po diaľnici A4, odboč na diaľnicu A6, ktorá vedie priamo do Bratislavy. Po príjazde do Bratislavy sleduj smer Praha/Brno a ihneď po prechode Dunaja zídite z diaľnice a pokračuj po ceste paralelnej s diaľnicou. Po niekoľko sto metroch prídete na nadjazd, kde odbočíte doľava, ponad diaľnicu smerom k výškovej budove Slovenskej televízie. Hneď za nadjazdom odboč doľava a následne doprava smerom do kopca k univerzitnému kampusu.

source: From Budapest, take the highway M1 heading to Gyor, follow this route until you see signs for highway M15 heading to Slovakia and Bratislava. After crossing the border follow the direction Praha or Brno according to instructions above.
sk: Z Budapešti po diaľnici M1 smerom na Gyor, neskôr odboč na cestu M15 smerom na Slovensko, do Bratislavy. Po prejazde hraníc pokračujte smerom na Brno podľa inštrukcií vyššie.

source: If you drive from Prague, take the highway D1 to Brno, once in Brno take the highway D2 heading to Slovakia and Bratislava. After arriving to Bratislava follow the highway and leave it at the exit Mlynska dolina after passing the tunnel. Be cautious, the exit is located right after the tunnel, so you should stay in the right lane while in tunnel.
sk: Z Prahy po diaľnici D1 do Brna, tam odboč na D2, ktorá vedie až na Slovensko a pokračujte smerom do Bratislavy. Po príjazde do Bratislavy pokračuj po diaľnici a opusti ju na výjazde Mlynská dolina (smer Devín, Karlova Ves), ktorý sa nachádza za tunelom. Pozor, výjazd začína hneď za tunelom, preraď sa včas.

source: From eastern and southern Poland choose your way to Katowice. From there follow the road to Cadca, Slovakia. Follow the road all the way to Zilina, then switch to the highway D1 to Bratislava. After arriving to Bratislava, you should pass the river of Danube twice following the direction Praha/Brno, then leave the highway following the instructions above.
sk: Z Poľska si zvoľ najlepšiu cestu do Katowíc. Odtiaľ pokčuj po ceste smerom na Čadcu a potom po ceste prvej triedy až do Žiliny. Odtiaľ po diaľnici D1 až do Bratislavy. V Bratislave pokračuj po diaľnici smerom na Prahu/Brno podľa vyššie uvedených inštrukcií (mal/a by si dvakrát prekročiť Dunaj).

source: By bus
sk: Autobusom

source: All neighbouring capital cities Vienna, Prague, Budapest, Warsaw and Kyiv have direct bus connections.
sk: Všetky okolité hlavné mestá - Viedeň, Praha, Budapešť, Varšava aj Kyjev - majú priame autobusové spojenie do Bratislavy.

source: Most of the buses will bring you to the main bus station - Mlynske Nivy. It is currently located in temporary location, so don't worry and keep calm if you arrive feeling like on construction site. Leave the area towards the blue oval building VUB (next to the building with BMW logo) where you find the station of city bus lines.
sk: Väčšina autobusov ťa dovezie na hlavnú autobusovú stanici - Mlynské Nivy. Momentálne sa nachádza v dočasnej lokalite, takže sa nezľakni, ak to tam bude vyzerať ako na stavenisku. Vyjdi zo stanice smerom k oválnej modrej budove VÚB (vedľa budovy s logom BMW), kde nájdeš stanicu mestskej dopravy.

source: Public transport is currently very limited due to the constructions.
sk: Verejná doprava je mmentálne veľmi obmedzená kvôli výstavbe v lokalite.

source: Even it is not shortest, we do recommend trolley bus to the main train station (and follow the instructions for train).
sk: Hoci to nie je najkratšia cesta, odporúčame trolejbus na hlavnú vlakovú stanicu (a ďalej pokračovať podľa inštrukcií pre cestu vlakom).

source: By train
sk: Vlakom

source: All neighboring capital cities Vienna, Prague, Budapest, Warsaw and Kyiv have direct train connections.
sk: Všetky okolité hlavné mestá Viedeň, Praha, Budapešť, Varšava a Kyjev majú priame vlakové spojenie.

source: Once you arrive at the Bratislava train station (Bratislava hlavná stanica), leave the station through the main entrance. In front of the building, there are bus and tram stops. We recommend you to take the bus number 32 to the station ZOO. If you plan to use city lines more often, we recommend you to check the website <a href="https://imhd.sk/ba/public-transport" title="IMHD - Bratislava - English" target="_blank" class="external">imhd.sk</a> for more information about the prices or the lines.
sk: Po príchode na bratislavskú hlavnú stanicu vyjdi hlavným východom. Pred budovou sú zástavky autobusov a električiek. Odporúčame ísť autobusom číslo 32 na stanicu ZOO. Ak sa plánuješ prepravovať po meste častejšie, pozri si stránku <a href="https://imhd.sk/ba/public-transport" title="IMHD - Bratislava - English" target="_blank" class="external">imhd.sk</a> pre viac informácií o cenách.

source: Accommodation
sk: Ubytovanie

source: There are plenty of opportunities for accommodation in Bratislava. From coach surfing, Airbnb to hostels and five star hotels. Even though it is not the main tourist season, we advise you to book your accommodations in advance.
sk: V Bratislave máš široké možnosti ubytovania: od coach surfingu cez Airbnb, hostely až po päťhviezdičkové hotely. Hoci sa konferencia koná mimo hlavnej turistickej sezóny, určite odporúčame zabezpečiť si ubytovanie v predstihu.

source: Guide
sk: Sprievodca

source: Bratislava offers much more than just PyCon. If you decide to stay in Bratislava a few days longer, have a look at <a href="http://mpba.sk/en" title="M_P_ BA: alternative Bratislava map" target="_blank" class="external">M_P_ BA</a> (alternative map of Bratislava) which lists popular attractions as well as unusual destinations within the city. Check out peoples' comments to find out about each location or event.
sk: V Bratislave sa popri konferencii môžete aj zabaviť a získať jedinečné zážitky. Ak sa rozhodnete ostať v Bratislave o niekoľko dní dlhšie, určite si pozri <a href="http://mpba.sk/sk" title="M_P_ BA: alternatívna mapa Bratislavy" target="_blank" class="external">M_P_ BA</a> (alternatívnu mapu Bratislavy), kde nájdeš prehľad obľúbených miest obyvateľov Bratislavy s ich autentickými odporúčaniami a subjektívnymi názormi.

source: Or you can review the <a href="http://www.visitbratislava.com/" title="city pages for visitors" target="_blank" class="external">official city guide for visitors</a>, where you can also find other events that are happening in Bratislava.
sk: Prípadne si môžeš pozrieť <a href="http://www.visitbratislava.com/sk" title="stránky mesta pre návštevníkov" target="_blank" class="external">oficiálne stránky mesta, určené pre návštevníkov</a>, kde nájdete aj iné udalosti, ktoré sa práve odohrávajú v Bratislave.

source: Topic
sk: Téma
