Repository: pyconsk/2020.pycon.sk
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: sk

source: About Us
sk: O nás

source: The mission of the SPy civic association (SPy is the abbreviation of "Slovak Python", or sometimes we say "Slovak Python User Group") is to support developers and users of the Python programming language. We support and we spread the programming language Python and other open source technologies and open source ideas in our society.
sk: Poslaním občianskeho združenia SPy (skratka "Slovak Python", alebo niekedy aj "Slovak Python User Group") je podpora vývojárov a používateľov programovacieho jazyka Python. Podporujeme a šírime používanie programovacieho jazyka Python a iných open source technológií a open source myšlienok v našej spoločnosti.

source: Our goal is to provide help and support for beginners and people who are new to programming. Another goal is to work with schools and other educational institutions, and promote programming (independent of the programming language) in children and young people from the earliest age.
sk: Našim cieľom je poskytovať pomoc a podporu úplným začiatočníkom a ľuďom, ktorí s programovaním začínajú. Ďalej si dávame za cieľ spolupracovať so školami a inými vzdelávacími inštitúciami a propagovať programovanie (nezávislé od programovacieho jazyka) u detí a mladých ľudí od čo najskoršieho možného veku.

source: We support the area of software development in socially vulnerable or otherwise disadvantaged social groups. We are dedicated to practical use of software development.
sk: Podporujeme oblasť softvérového vývoja u sociálne slabších alebo inak znevýhodnených sociálnych skupín. Venujeme sa praktickému využitiu softvérového vývoja.

source: We want to work on various open source projects, to create open educational content for use in schools as well as self-study and advocate for the use of open technologies in society and the public sector.
sk: Chceme spolupracovať na rôznych open source projektoch, vytvárať otvorený vzdelávací obsah použiteľný pri školskej výuke či samoštúdiu a zasadzovať sa o používanie otvorených technológii v spoločnosti a verejnom sektore.

source: Since 2015 we have organized dozens of events and projects. If you would like to know more, talk to us during the conference...
sk: Od roku 2015 sme zorganizovali desiatky stretnutí a projektov. Ak chcete vedieť viac, pozrite sa nižšie, na čom pracujeme...

source: Or visit our website
sk: alebo navštívte našu web stránku

source: Call for volunteers
sk: Pridaj sa k nám

source: Official PyCon SK 2020 website
sk: Oficiálna stránka PyCon SK 2020

source: You are using an <strong>outdated</strong> browser.
sk: Používate <strong>zastaraný</strong> prehliadač.

source: Please <a href="http://browsehappy.com/">upgrade your browser</a> to improve your experience.
sk: Prosím, <a href="http://browsehappy.com/">nainštalujte si novšiu verziu prehliadača</a>, aby ste si zlepšili zážitok z prehliadania stránok.

source: Newsroom
sk: Novinky

source: Speakers
sk: Rečníci a rečníčky

source: Call for proposals
sk: Prihlás svoj príspevok

source: Sponsors
sk: Sponzori

source: Code of Conduct
sk: Kódex správania

source: Venue
sk: Miesto konania

source: Buy Tickets
sk: Kúp si lístok

source: Event Organiser
sk: Organizátor podujatia

source: General Queries
sk: Všeobecné otázky

source: Ticket Queries
sk: Otázky o vstupenkách

source: Sponsor Queries
sk: Otázky o sponzorovaní

source: The PyCon SK 2020 conference, which will be held in Bratislava, is the annual gathering for the community using and developing the open-source Python programming language.
sk: Konferencia PyCon SK 2020, ktorá sa bude konať v Bratislave, je každoročné stretnutie komunity využívajúcej a vyvíjajúcej open sourcový programovací jazyk Python.

source: PyCon SK is organized by volunteers from %(spy)s.
sk: PyCon SK je organizovaný dobrovoľníkmi a dobrovoľníčkami z %(spy)s.

source: %(pycontm)s is a trademark for worldwide conference activities claimed by the %(psf)s.
sk: %(pycontm)s je ochranná známka %(psf)s pre celosvetové konferenčné aktivity.

source: Found a bug? Missing some information? This is a community managed website, so feel free to contribute to our %(github)s repository.
sk: Našiel/našla si chybu? Chýba ti nejaká informácia? Toto je komunitou manažovaná webstránka, prispej na našom %(github)se.

source: Call for Proposals
sk: Prihlás svoj príspevok

source: Anyone can be part of the conference.
sk: Aj ty môžeš byť súčasťou konferencie.

source: PyCon SK is organized by the Python community and for the Python community.
sk: PyCon SK organizuje Python komunita pre komunitu.

source: You're coming to the event, and that makes you part of the community. If you've done something that you think other people might be interested in, or that you think they should know about, please do consider telling us about it. We don't just want to hear from experts or famous names - other perspectives are just as valuable, so don't let the idea that you're not an expert or famous enough stop you. This is your invitation to submit a talk proposal if you haven't spoken at the conference before. First-time speakers' talk proposals will be preferred.
sk: Ak ideš na túto konferenciu, stávaš sa súčasťou komunity. Pokiaľ si spravil(a) niečo, čo by mohlo zaujímať aj iných, alebo si myslíš, že ostatní by o tom mali vedieť, príď nám o tom porozprávať. Nechceme počúvať iba expertov a známe osobnosti - noví perspektívni rečníci a rečníčky sú tiež zaujímaví, preto sa, prosím, nenechaj odradiť pocitom, že nie si expert(ka) alebo známa osobnosť. Toto je naša pozvánka, aby si poslal(a) návrh na prednášku, aj ak si ešte nikdy na konferencii neprednášal(a). Rečníči a rečníčky vystupujúci prvýkrát budú uprednostňovaní.

source: Don't hesitate
sk: Neváhaj

source: The Call for Proposals is closed!
sk: Predkladanie návrhov prednášok a workshopov je ukončené!

source: We are trying to finalize the conference program as soon as possible; the earlier you submit your proposal the higher chance of acceptance it has. <b>The deadline for submissions has been extended to 31 January 2020.</b>
sk: Snažíme sa uzavrieť program konferencie čo najskôr; čím skôr podáte svoj návrh, tým je vyššia šanca prijatia. <b>Termín predkladania návrhov bol predĺžený do 31. januára 2020.</b>

source: Still not sure about the details your proposal? No worries :-) After submitting your proposal, you will receive a confirmation email with a link with which you can return to your proposal and make changes.
sk: Nie si si istý/-á ohľadne svojho návrhu? Buď bez obáv :-) Po odoslaní návrhu dostaneš konfirmačný email s linkom, pomocou ktorého sa môžeš k svojmu návrhu vrátiť a upraviť ho.

source: You can reach out to us via email and we can discuss the topic you have chosen and also the abstract. If you need mentoring we'd love to help, just ask.
sk: Kontaktovať nás môžeš pomocou emailu a môžeme prediskutovať tému prednášky a tiež abstrakt. Ak potrebuješ mentoring, radi ti pomôžeme, stačí sa spýtať.

source: Give us a tip
sk: Daj nám vedieť o zaujímavých rečníkoch a rečníčkach

source: Do you know about a speaker that would be a good fit for our conference? <b>Let us know:</b>
sk: Poznáš niekoho, kto by mohol mať skvelý príspevok na PyCone a mali by sme ho/ju zavolať prednášať? <b>Daj nám vedieť:</b>

source: Guidelines for Proposal Submission
sk: Pokyny pre podávanie návrhov

source: There is no official restriction on the topic that you propose a talk session. Talks about Python or the Python community are most likely to line up with the interests of PyCon's audience, and a key consideration that the talk selection committee will be thinking about is your talk's ability to draw an audience. You may propose more than one, but the committee will ask you to choose only one talk if more than one of your proposals is accepted.
sk: Nie je žiadne oficiálne obmedzenie tém, ktoré môžeš navrhnúť ako svoju prednášku. Prednášky o Pythone alebo komunite budú s vysokou pravdepodobnosťou zaujímavé pre publikum. Hlavným kritériom, ktoré bude komisia pri výbere prednášok zvažovať, je to, ako tvoja prednáška zaujme publikum. Je stanovený limit na jednu prednášku pre rečníka/rečníčku. Navrhnúť môžeš viac ako jednu, komisia ťa však vyzve, aby si vybral(a) iba jednu prednášku (v prípade, že bude akceptovaných viac návrhov).

source: If you have any questions, please contact us via email: info@pycon.sk or join our Slack channel
sk: Ak máš otázky, kontaktuj nás emailom na info@pycon.sk alebo sa pridaj na náš Slack kanál.

source: All selected speakers get a complimentary ticket to the conference.
sk: Všetci rečníci a rečníčky majú vstup na konferenciu zadarmo.

source: Talks
sk: Prednášky

source: Most talks are 30 minutes long, but we do offer a limited number of 45-minute slots for important topics that promise to benefit from a more extensive treatment.
sk: Väčšina prednášok má vyhradenú dĺžku 30 minút, no ponúkame aj niekoľko 45 minútových vstupov pre významné témy, ktorým väčší rozsah umožní lepšie priblížiť danú tému publiku.

source: Workshops
sk: Workshopy

source: As with the talks, we are looking for tutorials that can grow this community at any level! We aim for tutorials that will advance Python, advance this community, and shape the future. As tutorials are longer than talks and are in an interactive classroom-like setting, they require much more preparation.
sk: Tak ako na prednášky, tešíme sa aj na workshopy, ktoré budú vhodné pre komunitu na akejkoľvek úrovni! Prostredníctvom takýchto výukových programov sa snažíme zveľaďovať Python komunitu a formovať budúcnosť. Vzhľadom na to, že workshopy trvajú dlhšie a sú omnoho interaktívnejšie, vyžadujú oveľa viac prípravy.

source: Are you involved in an interesting project, new service or application of technology? We would like to see your talk but if you - for any reason - prefer not to talk in a large auditorium or you think your achievements are of limited interest and therefore not suitable for the general audience, why not present what you are doing in the PyCon SK Poster Session?
sk: Pracuješ na zaujímavom projekte, novej službe či technologickej aplikácii? Radi by sme videli tvoju prednášku, ale ak z nejakého dôvodu nechceš prednášať vo veľkom auditóriu alebo si myslíš, že tvoja téma zaujme iba obmedzený počeť ľudí a nie je vhodná pre všeobecné publikum, príď nám ukázať, čo robíš, na PyCon SK Poster Session.

source: Recording release
sk: Súhlas so zverejnením nahrávok

source: Part of the motivation for PyCon SK is to help with Python education and advocacy in Slovakia and around the world. Accordingly, we intend to record all PyCon SK presentations and live stream and release the recordings on the web.
sk: Jednou z motivácií pre organizovanie PyConu je pomôcť so šírením vyučovania programovania v Pythone a jeho podporou na Slovensku i v zahraničí. Aj preto plánujeme nahrávať všetky prezentácie z konferencie a naživo streamovať a následne všetky zverejniť na webe.

source: By submitting your talk or workshop proposal, or by signing up to give a lightning talk, you agree to give permission to the SPy o.z. to record, edit, and release audio and/or video of your presentation.
sk: Odoslaním návrhu na prednášku alebo workshop alebo zapísaním sa na lightning talk dávaš súhlas SPy o.z. na nahrávanie, úpravu a zverejnenie audio a/alebo video záznamu z tvojej prezentácie.

source: Full recording release statement
sk: Plné znenie súhlasu s nahrávaním

source: PyCon SK Recording Release
sk: Súhlas so zverejnením nahrávok z PyConu SK

source: Submit your proposal
sk: Odoslať návrh príspevku

source: Still not sure about the details your proposal? No worries :-) <b>After submitting your proposal, you will receive a confirmation email with a link with which you can return to your proposal and make changes.</b>
sk: Ešte stále si nie si istý/-á konečným popisom tvojho príspevku? Nemusíš sa báť :-) Po vyplnení a odoslaní formulára obdržíš potvrdzovací mail, v ktorom bude odkaz na stránku, kde môžeš svoj príspevok kedykoľvek upraviť.

source: For all of the "paperwork" we use Google forms. You fill it on our page (just the form below), or you can submit the form directly:
sk: Na všetky "papierovačky" používame Google formuláre. Vyplň ich na našej stránke (formulár hneď pod týmto textom), alebo ho môžeš odoslať aj priamo:

source: About the speaker
sk: O rečníkovi/rečníčke

source: Your name
sk: Tvoje meno

source: Your name will be displayed on our website if your talk is accepted.
sk: Tvoje meno bude zobrazené na našom webe, ak bude prednáška akceptovaná.

source: If two or more people will be presenting, please separate the names with commas.
sk: V prípade, že príspevok bude prezentovať viacero ľudí, oddeľ mená prezentujúcich čiarkami.

source: Your email
sk: Tvoj email

source: Your email will not be published! We need it to get in touch and send you notification once the CfP ends.
sk: Tvoj email nebude zverejnený! Potrebujeme ho, aby sme sa vedeli skontaktovať a poslať notifikáciu po ukončení prihlasovania príspevkov.

source: Biography
sk: Životopis

source: Your biography will be displayed on our website if your talk is accepted.
sk: Tvoj životopis bude zobrazený na našom webe, ak bude prednáška akceptovaná.

source: If two or more people will be presenting, please separate the bios with a blank line.
sk: V prípade, že príspevok bude prezentovať viacero ľudí, oddeľ životopisy prázdnym riadkom.

source: Profile picture URL
sk: URL profilového obrázku

source: URL to your profile picture that will be displayed on our website if your talk is accepted.
sk: URL k tvojmu profilovému obrázku, ktorý bude zobrazený na našej webstránke, ak bude návrh na prednášku prijatý.

source: If two or more people will be presenting, please separate the URLs with a blank line.
sk: Ak budú prezentovať dvaja ľudia, zadajte URL do nového riadku.

source: Which country are you from?
sk: Odkiaľ pochádzaš?

source: We would like to publish a country name next to the speaker on our website if your talk is accepted.
sk: Radi by sme pri prednášajúcom/-ej zverejnili aj názov krajiny, ak bude prednáška akceptovaná.

source: Phone
sk: Telefón

source: Your phone will not be published! It is just for organizers to get in touch with you in case we need to discuss something with you or in case of emergency during the conference.
sk: Tvoj telefón nebude zverejnený! Je pre organizátorov, aby sa s tebou vedeli v prípade potreby spojiť pred alebo počas konferencie.

source: About talk
sk: O prednáške

source: Title
sk: Názov

source: The name of your talk/workshop as it will be displayed on our website if it is accepted.
sk: Názov tvojej prednášky/workshopu, ktorý bude zobrazený na našom webe, ak bude príspevok akceptovaný.

source: Abstract
sk: Abstrakt

source: The abstract of your talk will be published on our website if your talk is accepted.
sk: Abstrakt tvojho príspevku bude zverejnený na našom webe, ak bude príspevok akceptovaný.

source: Type
sk: Typ

source: What kind of session will you do?
sk: Aký typ príspevku plánuješ?

source: Talk
sk: Prednáška

source: Hardware Projects Showcase
sk: Ukážka hardvérových projektov

source: Language
sk: Jazyk

source: What language will your session be in?
sk: V akom jazyku bude tvoj príspevok?

source: English
sk: Anglicky

source: Slovak
sk: Slovensky

source: Czech
sk: Česky

source: Time Slot
sk: Časový blok

source: 30 minutes (talks)
sk: 30 minút (prednáška)

source: 45 minutes (talks/workshops)
sk: 45 minút (prednáška/workshop)

source: 60 minutes (workshops/Hardware Projects Showcase)
sk: 60 minút (prednáška/ukážka hardvérových projektov)

source: 90 minutes (workshops)
sk: 90 minút (workshop)

source: 120 minutes (workshops)
sk: 120 minút (workshop)

source: 3 hours (workshops)
sk: 3 hodiny (workshop)

source: 4 hours (workshops)
sk: 4 hodiny (workshop)

source: Skill level
sk: Úroveň

source: Which describes you best?
sk: Ktorá z týchto možností ťa najviac vystihuje?

source: I have never presented in front of 100+ people before.
sk: Nikdy som neprednášal(a) pred 100+ ľuďmi.

source: I gave a few (2-5) presentations at a conference of 100+ people.
sk: Už som mal(a) pár (2-5) prednášok na konferencii pred 100+ ľuďmi.

source: I spoke at a conference of 100+ people more than 5 times.
sk: Prednášal(a) som na konferenciách pre 100 a viac ľudí viac ako päťkrát.

source: Would you be interested in mentoring?
sk: Máš záujem o mentoring?

source: Please provide us with this answer only if you need travel funding so that we can calculate the ticket price.
sk: Prosím, odpovedz na túto otázku iba v prípade, že potrebuješ preplatiť cestovné náklady, aby sme mohli vypočítať cenu lístka.

source: Yes (if available)
sk: Áno (ak je to možné)

source: No
sk: Nie

source: Unsure
sk: Nie som si istý/-á

source: Link to a previous presentation?
sk: Odkaz na predchádzajúcu prezentáciu?

source: PyCon SK receives hundreds of visitors each year who are not native English speakers. We&#x27;d like to be sure that we can understand you clearly. Can you please share a link of a recording where you present something in English? If you don&#x27;t have such a link, please first create a quick 30-second recording. For example, you can read your Talk Abstract and upload it to YouTube (or elsewhere). Instructions:
sk: PyCon SK navštívia každoročne stovky ľudí, ktorých materinským jazykom nie je angličtina. Radi by sme sa uistili, že ti budeme dobre rozumieť. Prosím, pošli nám link s nahrávkou, kde prezentuješ niečo po anglicky. Ak taký link nemáš, prosím, vytvor najskôr krátku 30-sekundovú nahrávku - napríklad môžeš prečítať svoj abstrakt a nahrať to na YouTube (alebo kdekoľvek inde). Inštrukcie:

source: Travel funding
sk: Cestovné náklady

source: Do you need travel funding?
sk: Potrebuješ príspevok na cestovanie?

source: Please bear in mind that we are a community conference with a limited budget and we might not be able to fund you.
sk: Maj, prosím, na pamäti, že sme komunitná konferencia s obmedzeným rozpočtom a je možné, že ti nebudeme môcť preplatiť náklady.

source: Yes
sk: Áno

source: What city will you be traveling from?
sk: Z ktorého mesta budeš cestovať?

source: Please provide us with this city only if you need travel funding so that we can calculate the ticket price.
sk: Prosím, zadaj, z ktorého mesta budeš cestovať, ak potrebuješ preplatiť cestovné náklady, aby sme mohli vypočítať cenu lístka.

source: Do you need accommodation?
sk: Potrebuješ ubytovanie?

source: Submit
sk: Odoslať

source: Call for Volunteers
sk: Pridaj sa k nám

source: All of our staff members are volunteers. We are looking for new members to join the team of organizers.
sk: Všetci v našom tíme sú dobrovoľníci. Do tímu organizátorov hľadáme nových členov a členky.

source: This is a great opportunity to meet people, make new friends and learn new things.
sk: Je to skvelá príležitosť stretnúť ľudí, nájsť nových priateľov a aj sa naučiť nové veci.

source: As a volunteer you get a free ticket to the conference as a thank you for making a change in our society.
sk: Ako dobrovoľník či dobrovoľníčka dostaneš voľný lístok na konferenciu ako poďakovanie za to, že pomáhaš zlepšovať našu spoločnosť.

source: If you are a Slovak citizen and you work at least 40 hours a year as a volunteer, you can donate 3%% of your tax liability to any registered non-profit.
sk: Ak v priebehu roka odpracuješ viac ako 40 hodín ako dobrovoľník alebo dobrovoľníčka, môžeš darovať až 3%% zo svojich daní ktorejkoľvek zaregistrovanej neziskovke.

source: Your phone
sk: Tvoj mobil

source: Something about you
sk: Niečo o tebe

source: We would like to get to know you, write something about yourself and also why you would like to help out...
sk: Radi by sme vedeli niečo o tebe, ale aj prečo nám chceš pomôcť...

source: How much time can you spend volunteering?
sk: Napíš časový odhad, koľko by si sa mohol/mohla venovať dobrovoľníctvu pre SPy o.z..

source: We need just a rough estimate, for example: an hour a day, two hours a week...
sk: Stačí orientačná informácia, napr. hodina denne, dve hodiny týždenne...

source: What would you like to do?
sk: Je niečo konkrétne, čo by si rád/rada robil(a)?

source: Let us know what you are experienced in. If you have a vision and no experience, that is alright, write down what you would like to do and surely we'll find tasks to realize the vision.
sk: Ak je niečo, v čom máš skúsenosti, o ktoré sa chceš s nami podeliť, napíš nám, čo to je. Ak máš predstavu, čo chceš robiť a nemáš žiadne skúsenosti, nevadí, podeľ sa s nami o svoje predstavy a určite nájdeme úlohy, v ktorých sa môžeš realizovať...

source: Where did you find out about SPy o.z.?
sk: Odkiaľ si sa dozvedel(a) o SPy o.z.?

source: The Python community is made up of members from around the globe with a diverse set of skills, personalities, and experiences. It is through these differences that our community experiences great successes and continued growth. When you're working with members of the community, we encourage you to follow these guidelines which help steer our interactions and strive to keep Python a positive, successful, and growing community.
sk: Python komunitu tvoria ľudia z celého sveta s rôznorodým súborom zručností, osobností a skúseností. Tieto rozdiely prispievajú k tomu, že naša komunita prežíva veľké úspechy a pokračuje v raste. Keď pracuješ s členmi a členkami komunity, odporúčame ti dodržiavať tieto pokyny, ktoré pomáhajú riadiť tvoju interakciu s ostatnými a snažia sa udržať Python komunitu pozitívnu, úspešnú a rastúcu.

source: A member of the Python community is:
sk: Člen(ka) Python komunity je:

source: Open
sk: Otvorený/-á

source: Members of the community are open to collaboration, whether it's on PEPs, patches, problems, or otherwise. We're receptive to constructive comments and criticism, as the experiences and skill sets of other members contribute to the whole of our efforts. We're accepting of all who wish to take part in our activities, fostering an environment where anyone can participate and everyone can make a difference.
sk: Členovia a členky komunity sú otvorení k spolupráci, či už ide priamo o vývoj samotného Pythonu, štandardnej knižnice, dokumentácie, PEPov, vývoj iných Python projektov, iných open source projektov, riešenie spoločensko prospešných problémov, alebo o prácu na iných spriatelených projektoch. Sme vnímaví ku komentárom a konštruktívnej kritike, pretože skúsenosti a zručnosti ostatných členov a členiek prispievajú k celému nášmu úsiliu. Prijímame všetkých, ktorí sa chcú zúčastniť našich aktivít, podporujeme prostredie, kde sa môže ktokoľvek podieľať a každý ho môže zlepšiť.

source: Considerate
sk: Ohľaduplný/-á

source: Members of the community are considerate of their peers -- other Python users. We're thoughtful when addressing the efforts of others, keeping in mind that often times the labor was completed simply for the good of the community. We're attentive in our communications, whether in person or online, and we're tactful when approaching differing views.
sk: Členovia a členky komunity sú ohľaduplní voči ostatným používateľom a používateľkám Pythonu. Rešpektujeme úsilie druhých, pričom máme na pamäti, že častokrát ich práca bola venovaná len pre dobro komunity. Sme všímaví v našich vyjadreniach, či už osobne alebo on-line, a sme taktní, keď príde na rozdielne názory.

source: Respectful
sk: Úctivý/-á
