Repository: pyconsk/2020.pycon.sk
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: sk

source: Members of the community are respectful. We're respectful of others, their positions, their skills, their commitments, and their efforts. We're respectful of the volunteer efforts that permeate the Python community. We're respectful of the processes set forth in the community, and we work within them. When we disagree, we are courteous in raising our issues.
sk: Členovia a členky komunity sú úctiví. Rešpektujeme ostatných, ich názory, ich zručnosti, ich záväzky a ich úsilie. Rešpektujeme dobrovoľné úsilie, ktoré venujú Python komunite. Rešpektujeme postupy stanovené v komunite a využívame ich pri práci. Keď nesúhlasíme, sme zdvorilí pri adresovaní našich problémov.

source: Overall, we're good to each other. We contribute to this community not because we have to, but because we want to. If we remember that, these guidelines will come naturally.
sk: Celkovo sme dobrí k sebe navzájom. Prispievame k tejto komunite nie preto, že musíme, ale preto, že chceme. Ak si to uvedomíme, tak nám tieto pokyny prídu prirodzené.

source: Slovak Python Community
sk: Slovenská Python komunita

source: PyCon SK and Python Meetup fully identify with the Code of Conduct of the Python community. We create an environment, which is open to everyone, independently of sex, sexual orientation, race, education or religion. All communication should be respectful and on professional level. We will be tolerant to each other.
sk: PyCon SK aj slovenské Python stretnutia sa plne stotožňujú s kódexom správania Python komunity. Prinášame prostredie, ktoré je otvorené pre všetkých, nezávisle na pohlaví, sexuálnej orientácii, postihnutí, fyzickom vzhľade, veľkosti, rase, vzdelaní či vierovyznaní. Každá komunikácia by mala byť úctivá a na profesionálnej úrovni. Buďme k sebe navzájom tolerantní.

source: We do not offend, vilify other members. We behave professionally. Harassment, sexist, racist or otherwise demeaning jokes are improper at our meetings. We will not tolerate any harassment of participants of meetups in any form.
sk: Neurážame, ani nezhadzujeme iných účastníkov a účastníčky. Správame sa profesionálne. Obťažovanie, sexistické, rasistické, alebo inak znevažujúce vtipy sú nevhodné na našich stretnutiach. Nebudeme tolerovať obťažovanie účastníkov a účastníčok našich stretnutí v akejkoľvek forme.

source: Read more about code of conduct
sk: Prečítať si viac o kódexe správania

source: Your Email Here
sk: Napíš sem svoj email

source: email address for the newsletter
sk: emailová adresa pre odoberanie noviniek

source: Subscribe
sk: Prihlásiť sa

source: You can unsubscribe at any time by clicking the link in the footer of our emails.
sk: Odhlásiť sa môžeš kedykoľvek kliknutím na link na konci našich emailov.

source: View previous campaigns.
sk: Zobraziť predchádzajúce kampane.

source: We use Mailchimp as our marketing platform.
sk: Ako našu marketingovú platformu používame Mailchimp.

source: By clicking Subscribe, you acknowledge that your information will be transferred to Mailchimp for processing.
sk: Kliknutím na odber súhlasíš, že odošleme tvoje informácie na spracovanie do Mailchimpu.

source: Where Teachers meet Programmers
sk: Stretnutie učiteľov s programátormi

source: Friday
sk: Piatok

source: Saturday
sk: Sobota

source: Frequently Asked Questions
sk: Často kladené otázky

source: General Information
sk: Všeobecné informácie

source: Where will the conference take place?
sk: Kde sa bude konferencia konať?

source: Slovak University of Technology in Bratislava
sk: Slovenská technická univerzita v Bratislave

source: Faculty of Informatics and Information Technologies
sk: Fakulta informatiky a informačných technológií

source: What are the conference languages?
sk: Aké sú oficiálne jazyky konferencie?

source: Talks will be mostly in English or Slovak. There might be a few talks in Czech. If you don't speak Slovak or Czech, don't worry, at least one of the tracks will always be in English.
sk: Prednášky budú prevažne v angličtine a slovenčine. Niektoré môžu byť v češtine. Počas konferencie by mala prebiehať vždy aspoň jedna prednáška v angličine.

source: Volunteers do speak English. In Slovakia, English is a compulsory foreign language in schools, so most of the attendees should speak English.
sk: Dobrovoľníci hovoria po anglicky. Na slovensku je angličtina na školách povinným jazykom, takže väčšina účastníkov bude rozumieť po anglicky.

source: Tickets
sk: Lístky

source: What is the difference between self funded (individual rate) and full-price (corporate rate) ticket?
sk: Aký je rozdiel medzi cenou pre jednotlivca a plnou korporátnou cenou lístka?

source: Both tickets are valid for full three conference days. Including everything mentioned on tickets page. Difference is if you pay for the ticket yourself or your employer (company). For those who pay for them selves we are trying to be more inclusive so anybody can afford the ticket. This way we are able to support teachers and students for whom the price might be too high.
sk: Obidva lístky sú platné na všetky tri dni konferencie vrátane všetkého, čo je spomenuté v sekcii o lístkoch. Rozdiel je, či platíte za seba sami, alebo platí zamestnávateľ (firma). Snažíme sa vyjsť v ústrety tým, ktorí si konferenciu financujú sami, aby si ju mohlo dovoliť ščo najviac ľudí. Vďaka tomu vieme podporiť učiteľov a študentov, pre ktorých by štandardná cena lístka mohla byť príliš vysoká.

source: Companies can add the tickets to their costs.
sk: Firmy si môžu dať lístky do nákladov.

source: I don't have PayPal account, is there any other way to buy a ticket?
sk: Nemám PayPal účet, ako inak si môžem kúpiť lístok?

source: Currently, it is not possible to pay via PayPal without a Paypal account.
sk: Momentálne nie je možné platiť cez Paypal bez Paypal účtu.

source: Therefore we accept also a wire transfer. This method, however, requires manual processing, which may lead to little delay. Please send us a list of tickets you are interested in, we will send you variable symbol and after we receive the payment, we will issue and send the requested tickets to you by email.
sk: Preto akceptujeme aj bankový prevod. Táto metóda však vyžaduje manuálne spracovanie, čo môže spôsobiť menšie zdržanie. Prosím, pošlite nám zoznam lístkov, o ktoré máte záujem, pošleme vám variabilný symbol a po prijatí platby dostanete svoje lístky emailom.

source: We also accept Bitcoin, Litecoin and (possibly) other crypto currencies. Please send us a list of tickets you are interested in, and currency you want to use and we'll send you a wallet address and once the payment is confirmed, we will issue and send the requested tickets to you by email.
sk: Prijímame tiež Bitcoin, Litecoin a aj ďalšie kryptomeny. Prosím pošlite nám zoznam lístkov, o ktoré máte záujem a menu, v ktorej chcete platiť a my vám pošleme adresu peňaženky. Po potvrdení platby vám pošleme lístkyemailom.

source: For transaction in Bitcoin use: <a href="https://tallyco.in/s/e51yzw/" target="_blank">https://tallyco.in/s/e51yzw</a>
sk: Pre bitcoinové transakcie použite: <a href="https://tallyco.in/s/e51yzw/" target="_blank">https://tallyco.in/s/e51yzw</a>

source: What is included in the ticket price?
sk: Čo je zahrnuté v cene lístka?

source: We made a list of things you can expect at the conference on <a href="%(url)s">the tickets page</a>.
sk: Pripravili sme zonam vecí, ktoré môžete očakávať na konferencii na stránke o <a href="%(url)s">vstupenkách</a>.

source: Do you offer group discounts?
sk: Ponúkate skupinové zľavy?

source: If you would like to buy more than 15 tickets, please contact us by email at info@pycon.sk.
sk: Ak by ste chceli kúpiť viac ako 15 lístkov, kontaktujte nás emailom na info@pycon.sk.

source: Is there any another possibility to attend PyCon?
sk: Existuje iný spôsob, ako sa zúčastniť Pyconu?

source: Yes, you can <a href="%(url)s">submit a talk</a>, and if your talk is selected, you will receive a speakers ticket for free.
sk: Áno, môžete <a href="%(url)s">podať návrh na prednášku</a>, a ak bude prijatý, dostanete rečnícky lístok zadarmo.

source: If you are less than 15 years old and come accompanied by a parent, you can just purchase one ticket only for the parent, but you have to inform us in advance to issue an another ticket for the child.
sk: Ak máte menej ako 15 rokov a prídete v sprievode rodiča, stačí si kúpiť lístok pre rodiča. Prosím vopred nás informujte, aby sme pripravili ďalší lístok pre dieťa.

source: Will there be last moment tickets?
sk: Budú last moment lístky?

source: Last 50 tickets will be more expensive, so don't leave your ticket purchase to last moment!
sk: Posledných 50 lístkov budeme predávať za vyššie ceny, takže si nenechávajte nákup na poslednú chvíľu!

source: Do you have a social event in the evening?
sk: Bude aj oficiálny večierok?

source: On Friday, there will be an unofficial party in a pub. There is no need to purchase a special ticket.
sk: V piatok bude neoficiálna párty v krčme. Na ňu nie je potrebné kupovať si špeciálny lístok.

source: On Saturday, we'll have an official conference dinner! You can purchase a ticket for this event.
sk: V sobotu budeme mať oficiálnu konferenčnú večeru. Na túto udalosť si môžete kúpiť lístok.

source: Is my conference ticket valid for the FRIDAY unofficial party?
sk: Platí môj konferenčný lístok na PIATKOVÚ neoficiálnu párty?

source: YES. You don't have to purchase a ticket for the FRIDAY unofficial party. We won\u2019t cover any of your expenses.
sk: ÁNO. Na PIATKOVÚ neoficiálnu párty si nemusíte kupovať lístok. Avšak každý si platí sám za seba.

source: Is my conference ticket valid for the SATURDAY conference dinner (official social event)?
sk: Platí môj konferenčný lístok na SOBOTNÚ konferenčnú večeru (oficiálny večierok)?

source: NO. You have to purchase a ticket for the SATURDAY conference dinner (official social event). Ticket to the dinner includes dinner in a form of a buffet and a welcome drink. You pay for all other drinks.
sk: NIE. Na SOBOTNÚ konferenčnú večeru (oficiálny večierok) si musíte kúpiť špeciálny lístok. Lístok zahŕňa večeru vo forme bufetu a welcome drinku. Ďalšie drinky si platí každý za seba.

source: Bratislava, Slovakia
sk: Bratislava

source: About PyCon SK
sk: O konferencii PyCon SK

source: It is organized by volunteers from the SPy o.z., civic association dedicated to advancing and promoting Python and other Open Source technologies and ideas.
sk: Je organizovaná dobrovoľníkmi a dobrovoľníčkami z občianskeho združenia SPy o.z. zameraného na šírenie jazyka Python a ďalších open sourcových technológií a myšlienok.

source: Through PyCon, the SPy o.z. advances its mission of growing the Slovak (and also international) community of Python programmers and Open Source supporters.
sk: Prostredníctvom PyConu SPy o.z. napĺňa svoj cieľ rozširovať slovenskú (a aj medzinárodnú) komunitu Python programátorov a programátoriek a ľudí podporujúcich open source.

source: EduSummit is a special section of the conference focused on teaching programming at primary and secondary schools.
sk: EduSummit je špecializovaná časť konferencie zameraná na vyučovanie programovania na základných a stredných školách.

source: We are now organising the fourth edition, a two day summit during which teachers will be introduced to innovative ways and methods of teaching programming, share their knowledge of useful tools and last but not least participate in numerous workshops given by experienced educators.
sk: Už po štvrtý raz organizujeme tentokrát dvojdňový summit, počas ktorého učiteľkám a učiteľom predstavíme inovatívne spôsoby a metódy vyučovania programovania, podelíme sa o skúsenosti s užitočnými nástrojmi a taktiež sa spolu zúčastníme workshopov pod vedením skúsených mentorov a mentoriek.

source: Participants
sk: účastníkov a účastníčok

source: News
sk: Novinky

source: There are a lot of things going on around conference... Here are some of them...
sk: Okolo konferencie sa stále deje kopec vecí... Tu je niekoľko z nich...

source: Read more
sk: Čítaj viac

source: Speakers that who have already confirmed attendance at PyCon SK 2020.
sk: Rečníci, ktorí už potvrdili účasť na PyCon SK 2020.

source: You can fill the Call for Proposals and join this list...
sk: Vyplň návrh na prednášku a pridaj sa do zoznamu...

source: Get Your Ticket Now
sk: Kúp si lístok teraz

source: Conference tickets are available for purchase. So far each PyCon SK edition has sold out, so do not leave buying your ticket to the last moment, because they might be gone...
sk: Lístky na konferenciu sú už v predaji. Doteraz sa každý PyCon SK vypredal, takže si nenechávaj nákup lístka na poslednú chvíľu, lebo už môžu byť vypredané...

source: Official Sponsors &amp; Partners
sk: Oficiálni sponzori a partneri

source: We are looking for sponsors and partners. Please get in touch with us.
sk: Hľadáme sponzorov a partnerov. Prosím, kontaktujte nás.

source: Check Who Makes This Event Possible!
sk: Pozri sa, bez koho by táto konferencia nebola možná!

source: Become a Sponsor
sk: Staň sa sponzorom

source: Subscribe to one of our newsletters
sk: Prihláste sa na odber jedného z našich newslettrov

source: Newsletter in SLOVAK
sk: Newsletter v Slovenčine

source: Receive updates <strong>in Slovak</strong> about PyCon SK <br>& Python meetups held in <strong>Slovak or English</strong> <br>(approximately one email every 1-2 months)
sk: Dostávajte novinky <strong>v Slovenčine</strong> o PyCon SK <br>& Python meetupoch s prednáškami <br><strong>v Slovenčine alebo Angličtine</strong> <br>(približne jeden mail každý 1-2 mesiace)

source: Newsletter in ENGLISH
sk: Newsletter v Angličtine

source: Receive updates <strong>in English</strong> about PyCon SK <br>& Python meetups held in <strong>English only</strong> <br>(3-5 emails per year)
sk: Dostávajte novinky <strong>v Angličtine</strong> o PyCon SK <br>& Python meetupoch s prednáškami <br><strong>iba v Angličtine</strong> <br>(3-5 mailov za rok)

source: For information about privacy practices, please visit our <a href="%(url)s">Privacy Policy</a>.
sk: Pre informácie o našich postupoch na ochranu súkromia navštív naše <a href="%(url)s">Zásady ochrany súkromia</a>.

source: Category
sk: Kategória

source: Categories
sk: Kategórie

source: All
sk: Všetky

source: Privacy Policy
sk: Ochrana súkromia

source: SPy o.z. values and respects all individuals and organizations that utilize our services. We understand that you may be concerned about privacy issues that surround the use of the Internet.
sk: SPy o.z. si cení a rešpektuje všetky osoby a organizácie, ktoré využívajú naše služby. Rozumieme, že môžeš mať obavy o svoje súkromie v súvislosti s používaním internetu.

source: We believe that you should have control over who receives your personal information, whether it concerns where you live, what your interests are, or how you choose to conduct transactions. We're focused on only one thing: managing the Python community in Slovakia in a safe and secure environment.
sk: Sme presvedčení, že každý by mal mať kontrolu nad tým, kto dostáva jeho osobné informácie, či už o tom, kde žije, aké sú jeho záujmy, alebo ako vykonáva transakcie. Naším cieľom je len jediné: riadiť Python komunitu na Slovensku v bezpečnom prostredí.

source: Therefore, we do not disclose, share, sell, or trade information about your individual visits to *.pycon.sk or the information that you may give us such as your name, address, e-mail address or telephone number, to any outside companies. We will release personal information about you, if necessary, in order to comply with a valid legal process such as a search warrant or court order. If we receive such request we'll transparently create a transparency report.
sk: Preto neuvádzame, nezdieľame, nepredávame informácie o tvojich jednotlivých návštevách na *.pycon.sk alebo informácie, ktoré si nám mohol/mohla poskytnúť, ako napríklad meno, adresu, emailovú adresu alebo telefónne číslo, žiadnej spoločnosti alebo jednotlivcovi. Tvoje osobné údaje sprístupnime, iba ak to bude potrebné v súvislosti s právnymi predpismi, napríklad v prípade hľadania osoby či v prípade súdneho procesu. V prípade, že dostaneme takúto požiadavku, transparentne vytvoríme požadovaný report.

source: Other Web sites that you may link to from our site, including our partners' Web sites, have their own privacy policies. SPy o.z. is not responsible for the privacy practices of other Web sites. We encourage you to review the privacy policies of Web sites before providing them with any of your personal information.
sk: Iné web stránky, na ktoré môžu smerovať linky z našej web stránky, vrátane webstránok našich partnerov, majú svoje vlastné pravidlá na ochranu súkromia. SPy o.z. nie je zodpovedné za dodržovanie takýchto pravidiel na iných webstránkach. Odporúčame preštudovať si pravidlá ochrany súkromia webstránok predtým, ako im poskytneš akékoľvek osobné údaje.

source: At our events, we respect our participants' choice should they wish to not be photographed. Our official photographers will not make photos of them. We ask other participants to also do so.
sk: Na našich stretnutiach aj na konferencii rešpektujeme želanie ľudí nebyť fotografovaní, pokiaľ si to neželajú. Oficiálni fotografi a fotografky budú takýchto ľudí ignorovať. Taktiež žiadame o to isté aj účastníkov a účastníčky našich akcií.

source: We respect the Code of Conduct. Let us know if you feel we can improve our privacy and policy rules.
sk: Rešpektujeme Kódex správania. Daj nám vedieť, ak sa ti zdá, že naše pravidlá, či už na ochranu súkromia alebo iné, môžeme zlepšiť.

source: How SPy o.z. Uses Information About You
sk: Ako Spy o.z. využíva informácie o tebe

source: When you register for an event, make a donation or select a volunteer opportunity, we may specifically ask for information about you -- such as name, home or Internet address, and billing information -- in order to provide that service or information to you. This information will be used solely for the purposes of completing your registration, donation or locating the volunteer opportunity you are seeking.
sk: Ak sa zaregistruješ na naše podujatie, pošleš nám príspevok alebo sa prihlásiš ako dobrovoľník či dobrovoľníčka, môžeme od teba požadovať určité informácie, napríklad meno, domácu alebo internetovú adresu či fakturačné údaje, aby sme ti mohli poskytnúť požadovanú službu či informáciu. Takáto informácia bude použitá výlučne na účely dokončenia tvojej registrácie, príspevku alebo zadeleniu dobrovoľníckej práce.

source: The information which SPy o.z. automatically gathers, such as the numbers and frequency of visitors to our site and its areas, is used only in the aggregate -- very much like television ratings that tell the networks how many people tuned in to a program. This collective data helps us determine how much our visitors use parts of the site so that we can improve our site to assure that it is as appealing as we can make it for as many of you as possible.
sk: Informácie, ktoré SPy o.z. automaticky zbiera, ako napríklad počet a frekvencia návštev webstránok, sa vyhodnocujú iba agregovane, ako napríklad hodnotenie televízií, ktoré hovorí, koľko ľudí sledovalo jej program. Tieto kolektívne údaje nám pomáhajú určiť, koľko našich návštevníkov a návštevníčok používa našu webstránku a jej súčasti, vďaka čomu ju môžeme vylepšovať, aby bola príťažlivá a dostupná pre čo najväčšie množstvo ľudí.

source: SPy o.z. Security
sk: SPy o.z. a bezpečnosť

source: SPy o.z. takes every precaution to protect the information of our users. When users submit sensitive information via the Web site, your information is protected both online and offline.
sk: SPy o.z. robí všetky opatrenia pre ochranu užívateľských informácií. Keď užívateľ(ka) posiela citlivé informácie prostredníctvom webovej stránky, tieto informácie sú chránené online aj offline.

source: SPy o.z. uses Secure Sockets Layer (SSL) technology to keep your personal information as secure as possible. SPy o.z. helps to protect your information by working with partners that provide a secure and safe environment for credit card transactions.
sk: SPy o.z. používa technológiu Secure Socket Layer (SSL) za účelom bezpečného spracovania tvojich informácií. SPy o.z. pomáha chrániť tvoje údaje spoluprácou s partnermi, ktorí prevádzkujú bezpečné prostredie pre transakcie kreditnou kartou.

source: Third party services that may obtain some information about you:
sk: Služby tretích strán, ktoré môže získať časť informácií o tebe:

source: <strong>Tito</strong>: Event management website that we use for booking event tickets. Read their privacy and policy:
sk: <strong>Tito</strong>: webstránka na riadenie eventov, využívame ju na registráciu vstupeniek. Prečítaj si jej pravidlá ochrany súkromia:

source: <strong>PayPal</strong>: Payment provider that we use for ticket payments. Read their privacy and policy:
sk: <strong>PayPal</strong>: Sprostredkovateľ platieb. Využívame ho na platby za vstupenky na konferenciu. Prečítaj si jeho pravidlá ochrany súkromia:

source: <strong>Google Analytics</strong>: Website performance analytics that we use to collect aggregated data about our website visitors. Read their privacy and policy:
sk: <strong>Google Analytics</strong>: Nástroj na analýzu výkonu webstránok. Využívame ho na zber agregovaných dát o návštevníkoch a návštevníčkach našich webstránok. Prečítaj si jeho pravidlá ochrany súkromia:

source: <strong>MailChimp</strong>: Newsletter and event update mass email provider that we use to send emails to multiple recipients. Read their privacy and policy:
sk: <strong>MailChimp</strong>: Nástroj na posielanie newslettrov a hromadných emailov. Využívame ho na rozposielanie emailov viacerým prijímateľom. Prečítaj si jeho pravidlá ochrany súkromia:

source: Third party services that could be avoided:
sk: Služby tretích strán, ktorým sa dá vyhnúť:

source: <strong>Tito</strong>: Join us at events that do not require tickets, such as our monthly Python meetups. Unfortunately, for a conference like PyCon SK tickets are required; however, you can use a pseudonym as we won't ask for your ID if you have a valid ticket (without any discount; for discounted tickets, a student ID or similar might be required).
sk: <strong>Tito</strong>: Pridaj sa k nám na udalostiach, na ktoré nepotrebuješ vstupenky, napríklad pravidelné každomesačné stretnutia - meetupy. Bohužiaľ, na konferenciu PyCon SK je potrebná vstupenka pre každého, no môžeš použiť pseudonym, keďže nepožadujeme doklad totožnosti, ak máš platný lístok (bez zľavy, v prípade zľavnených lístkov môžeme požadovať študentský preukaz alebo podobný doklad).

source: <strong>PayPal</strong>: Request a payment via alternative methods: Bank transfer, cryptocurrencies. An extra fee for additional human work may apply.
sk: <strong>PayPal</strong>: Vyber si alternatívny spôsob platby: Bankovým prevodom, kryptomenami. V tomto prípade však môže byť účtovaný extra poplatok za ručné spracovanie transakcie.

source: <strong>Google Analytics</strong>: Use an ad blocker to block this service automatically for every site on the internet.
sk: <strong>Google Analytics</strong>: Používaj blokovanie trackerov na automatické blokovanie tejto služby na ktorejkoľvek stránke na internete.

source: <strong>MailChimp</strong>: Do not subscribe to our newsletter, or request us not to include your email in mass emails when requesting an alternative payment method. If you are already subscribed, you can unsubscribe at any time, by clicking the link in the email footer.
sk: <strong>MailChimp</strong>: Neprihlás sa na odber newslettra, alebo nás požiadaj o vyňatie emailu z hromadného emailingu. Ak už si prihlásený/-á, môžeš sa odhlásiť kedykoľvek kliknutím na link na konci emailu.
