[
    {
    "date": "2020-03-07",
    "title_en": "PyCon SK will be postponed.",
    "meta_en": "COVID-19 virus is spreading across the Europe and unfortunately Slovakia is no exception.\n\nWe have monitored the situation closely and we have been discussing with the Public Health Authority and being advice to postpone the conference. We prepared number of proactive measures, but we are not able to guarantee health and safety of our attendees. We have considered the option to do the PyCon SK online, but we believe that the spirit of the community is by getting together.\n\nWe have made a responsible decision to postpone PyCon SK to later date. Conference will happen in September 2020.\n\nWe do apologize for the trouble and we hope you'll understand our decision. We do hope our decision will not cause you too much inconvenience.\n\nThank you for your support and look forward to the September 2020 meeting.",
    "title_sk": "PyCon SK bude v neskoršom termíne.",
    "meta_sk": "Vírus COVID-19 sa šíri po Európe a žiaľ Slovensko, nie je výnimkou.\n\nSituáciu sme pozorne sledovali a diskutovali sme s Úradom verejného zdravotníctva a odporučili nám odložiť konferenciu. Pripravovali sme o viacerých proaktívnych opatreniach, ale nedokážeme plne zaručiť zdravie a bezpečnosť našich účastníkov. Zvažovali sme tiež o možnosti online konferencie PyCon SK, ale rozhodli sme sa, že duchom komunity je stretávanie sa.\n\nPreto sme sa zodpovedne rozhodli presunúť PyCon SK na neskorší termín. Konferencia sa uskutoční v septembri 2020.\n\nVeríme, že naše rozhodnutie pochopíte a presun Vám nespôsobí nepríjemnosti.\n\nĎakujeme za podporu a tešíme sa na stretnutie v septembri 2020.",
    "categories": ["conference"]
   },
   {
    "date": "2020-03-03",
    "title_en": "PyCon SK risk assessment on COVID-19.",
    "meta_en": "Right now, there are zero confirmed cases of COVID-19 (coronavirus) in Slovakia. We have been in touch with the Public Health Authority and they said that there are currently no limitations on public gatherings but also pointed out that the situation may evolve. We have discussed a number of proactive measures to make PyCon SK safe event. We do take COVID-19 seriously, and preparing for several scenarios, but so far there is no reason for panic.",
    "title_sk": "PyCon SK a vyhodnocovanie rizika nákazy COVID-19.",
    "meta_sk": "Na Slovensku nebol doteraz potvrdený výskyt ochorenia COVID-19 (koronavírus). Kontaktovali sme Úrad verejného zdravotníctva a aktuálne nie sú žiadne obmedzenia pre verejné zhromaždenia, avšak situácia sa môže zmeniť. Aktuálne zvažujeme proaktívne opatrenia, aby PyCon SK bol bezpečný. Hrozbu COVID-19 berieme vážne a pripravujeme viaceré scenáre, avšak zatiaľ nie je dôvod na paniku.",
    "categories": ["conference"],
    "url": "https://www.ecdc.europa.eu/en/cases-2019-ncov-eueea"
   },
   {
    "date": "2020-02-14",
    "title_en": "Python 2 Good Bye Party.",
    "meta_en": "Did you know that the last Python 2 release 2.7.18 will be released in April 2020: https://www.python.org/dev/peps/pep-0373/? Python 2 has been with us almost 20 years and Python 2.7 itself nearly 10 years. We decided to make Python2 Good Bye Party! If you are on PyCon SK 2020, come to a good bye party on Saturday 28th, it will be the last Python 2 good bye party in Europe! The tickets are already available for sale...",
    "title_sk": "Python 2: Rozlúčková party",
    "meta_sk": "Vedeli ste, že posledný release Pythonu 2 verzia 2.7.18 bude vydaný v apríli 2020: https://www.python.org/dev/peps/pep-0373/? Python 2 tu bol s nami 20 rokov (prvá verzia vyšla v roku 2000) a samotný Python 2.7 takmer 10 rokov. Preto sme sa rozhodli, že spravíme Python2 Good Bye Party! Ak budete na PyCon SK 2020, príďte v sobotu 28.3. rozlúčkovú party, bude to posledná Python 2 good bye party v Európe! Lístky sú už od dnes v predaji...",
    "categories": ["conference"],
    "url": "/en/tickets.html"
  },
   {
    "date": "2020-02-01",
    "title_en": "CfP has been closed.",
    "meta_en": "We have received more than a hundred proposals, thanks everyone for the interest. Comittee is reviewing all the proposals and will contact everyone as soon possible.",
    "title_sk": "Prihlasovanie prednášok bolo uzavreté.",
    "meta_sk": "Obdržali sme viac ako sto návrhov na prednášky, ďakujeme všetkým za záujem. Komisia vyhodnocuje všetky vaše návrhy a bude kontaktovať všetkých čo najskôr.",
    "categories": ["speakers"],
    "url": "/en/cfp.html"
  },
  {
    "date": "2020-01-09",
    "title_en": "We are extending CfP deadline.",
    "meta_en": "We have received a lot of high quality proposals, but also few requests to extend the period for the CfP since it ends earlier than in the past years. We have decided to extend CfP to the end of January.",
    "title_sk": "Predlžujeme termín prihlasovania prednášok na konferenciu.",
    "meta_sk": "Obdržali sme veľa kvalitných návrhov na prednášku, ale aj niekoľko žiadostí o predĺženie termínu na prihlásenie prednášky. Vzhľadom na to že tento ročník uzatvára prihlasovanie prednášok skôr, sme sa rozhodli predĺžiť prihlasovanie prednášok do konca Januára.",
    "categories": ["speakers"],
    "url": "/en/cfp.html"
  },
  {
    "date": "2019-11-23",
    "title_en": "Conference chat.",
    "meta_en": "Last year we have used Slack as our conference chat so you can get in touch with organizers and also with fellow participants. For PyCon SK 2020 chat we are going to use the Slack.",
    "title_sk": "Konferenčný chat.",
    "meta_sk": "Minulý rok sme používali Slack ako konferenčný chat, pomocou ktorého ste mohli komunikovať s organizátormi a aj s ďalšími účastníkmi. Aj na PyCon SK 2020 budeme používať Slack.",
    "categories": ["media"],
    "url": "https://join.slack.com/t/pyconsk/shared_invite/enQtODQ4NjU1NzM2NzI3LTA2ZGNiOTA4YzM5OWM3NmQyZjAxMDlmNzJjOGIzNjM4ZjEwZGI0MTJiYzAxZmNhZmVjMTZjZjliNWQ4ZjVlNjE"
  },
  {
    "date": "2019-11-16",
    "title_en": "First batch of speakers.",
    "meta_en": "We are honoured to announce the first batch of speakers that will be part of PyCon SK 2020.",
    "title_sk": "Prvá várka rečníkov.",
    "meta_sk": "Je nám cťou predstaviť prvých potvrdených rečníkov na PyCon SK 2020.",
    "categories": ["speakers"]
  },
  {
    "date": "2019-11-15",
    "title_en": "We celebrate the Day of Fighting for Freedom and Democracy.",
    "meta_en": "On 17th November we celebrate the Day of Fighting for Freedom and Democracy. Thanks to this event we can freely organize PyCon SK. We want you to celebrate with us. During the holiday you can use 17% discount for tickets using discount code \"30-rokov-slobody\".",
    "title_sk": "Oslavujeme Deň boja za slobodu a demokraciu.",
    "meta_sk": "17. novembra oslavujeme Deň boja za slobodu a demokraciu. Vďaka tejto udalosti môžeme slobodne organizovať PyCon SK. Chceme, aby ste oslavovali aj vy. Počas celého sviatku môže využiť zľavu 17% na lístky s promo kódom \"30-rokov-slobody\".",
    "categories": ["conference"],
    "url": "https://en.wikipedia.org/wiki/Velvet_Revolution"
  },
  {
    "date": "2019-10-20",
    "title_en": "The Call for Proposals is open!",
    "meta_en": "Do you know anyone in underrepresented group in IT who would like to do a conference talk? Let us know, and try to encourage him/her to submit Call for Proposals for PyCon SK 2020. We are trying to support diversity. Anyone can be part of the conference.",
    "title_sk": "Predkladanie prednášok a workshopov je otvorené!",
    "meta_sk": "Poznáš niekoho z málo zastúpenej skupiny v IT, kto by chcel urobiť prednášku na konferencii? Daj nám vedieť a povzbuď ho/ju, aby si podal/a návrh na prednášku na PyCon SK 2020. Snažíme sa podporovať rôznorodosť.",
    "categories": ["speakers"],
    "url": "/en/cfp.html"
  }
]
