[
    {
        "name": "Tom Dyson",
        "bio": "Tom graduated from Balliol College, Oxford, in 1995, swapping the later philosophy of Wittgenstein for Netscape 2 and a 9600 baud modem. He ran a little agency called Naïve (“Why don’t you just call yourselves ‘Stupid’?”) until he joined forces with Olly in 2000, starting Torchbox with the aim of building beautiful online software for people who make the world a better place. As Technical Director, Tom is responsible for making sure the things we build are fast and reliable and easy to maintain. He manages the tech team and account directs many of our large technical projects. Along with Olly, Tom tries to make Torchbox a fun and inspiring place to work. Tom lives with his family in the countryside. He reads novels and gets cross at tennis. He plays in three bands who will probably never make it. He composed the theme tune to Charlie and Lola.",
        "country": "United Kingdom",
        "avatar": "img/speakers/tom_dyson.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/tomdyson/",
            "link": "https://torchbox.com/team/tom-dyson/"
        }
    },
    {
        "name": "Roman Imankulov",
        "bio": "Roman is a software developer who started his career creating web apps with Django before it was cool. Eventually he sticks to Python for more than a decade, successfully using it as a golden hammer it to solve all kinds of problems. Originally Russian, at the moment he lives in Porto and works at Doist as head of the back-end development team.",
        "country": "Portugal",
        "avatar": "img/speakers/roman_imankulov.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/roman-imankulov-91076144/",
            "twitter": "https://twitter.com/rdotpy",
            "github": "https://github.com/imankulov"
        }
    },
    {
        "name": "Emilie Sengstschmid",
        "bio": "Emilie Sengstschmid is working as a software engineer at the University of Applied Arts Vienna. In 2016 she joined the Portfolio/Showroom project, whose main aim is to enable artists and scientists to announce, store and publish their own work and to exchange ideas with colleagues. Her responsibilities concern the entire development process from requirements engineering to deployment. She had worked on high performance applications at the Austrian Federal Computing Center before. She holds a bachelor's degree in Engineering.",
        "country": "Austria",
        "avatar": "img/speakers/emilie_sengstschmid.jpg",
        "links": {
        }
    },
    {
        "name": "Michal Cyprian",
        "bio": "Michal works as a software engineer at Kiwi.com. Python is his language of choice since high school. He likes challenges, travelling and learning new things.",
        "country": "Slovakia",
        "avatar": "img/speakers/michal_cyprian.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/michal-cyprian-b5b915127/"
        }
    },
    {
        "name": "Filipa Andrade",
        "bio": "I am a software engineer working mainly with python, django and recently with flask. I love programming, I enjoy developing a project from scratch but also I have fun debugging, fixing and refactoring legacy code. Currently my main interest in programming is writing readable and beautiful code, I believe you can't have one without the other.",
        "country": "Portugal / Slovakia",
        "avatar": "img/speakers/filipa_andrade.jpg",
        "links": {
        }
    },
    {
        "name": "Dom Weldon",
        "bio": "Dom Weldon is a Principal Software Engineer at decisionLab, a London-based mathematical modelling consultancy with expertise in machine learning, simulation, optimization and visualization. Dom's team specialize in taking models from data scientists and turning them into production ready tools. Current clients include the Royal Navy, Siemens and various UK public bodies.\n\nDom came to decisionLab from his PhD studies in Computational Geography at King's College London, his initial degree was in Natural Sciences at the University of Cambridge, and holds a master's in the historical and cultural geography of the Cold War United States. Outside of work, Dom is interested in languages and travelling, and holds a voluntary statutory appointment on a board monitoring the welfare and dignity of prisoners in a challenging North London jail.",
        "country": "United Kingdom",
        "avatar": "img/speakers/dom_weldon.jpg",
        "links": {
            "link": "https://www.decisionlab.co.uk/"
        }
    },
    {
        "name": "Ines Meršak",
        "bio": "I hold a Master’s degree in mathematics and am currently a software developer at Bitstamp. I believe in writing and testing good software and am happiest when I get a lengthy peer review. I am also interested in data structures and algorithms and spend too much time playing RPGs (and too little time practising my guitar).",
        "country": "Slovenia",
        "avatar": "img/speakers/ines_mersak.jpg",
        "links": {
        }
    },
    {
        "name": "Nicholas Thapen",
        "bio": "Nick is a founder of Sourcery, a startup that is using AI to help everyone write better code faster. He is a developer and architect with over a decade of experience in both academia and industry. He worked on machine learning and Twitter analytics at Imperial College London, and has also spent time as a developer and architect in the financial sector.",
        "country": "United Kingdom",
        "avatar": "img/speakers/nick_thapen.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/nicholas-thapen/",
            "twitter": "https://twitter.com/nthapen",
            "link": "https://sourcery.ai/"
        }
    },
    {
        "name": "Lilian Nandi",
        "bio": "Lilian studied Computer Science at high school and did her PhD in Computer Modelling from University College London. She went on to looking at computer applications and programming in the pharmaceutical sector before entering formal teaching for the next generation. She is currently engaged in teaching Python programming, C# and Javascript. She has given lectures in conferences both in the UK and abroad about the teaching of Computer Programming to young people. She has ran computer clubs including that of 'computer-assisted' investment for children and is a full member of the British Computer Society.\n\nLilian firmly believes that in this emergent brave new world, the Anthrpocene age, the computer (with its associated technologies) is the harbinger to transform globally man's short slavish existence to a better one - a world community defined by longer, richer and freer life experiences. She believes it is imperative that our schools empower our young children with his new knowledge, and Lilian herself did help reshape the Computer Science Department of an independent boys' school as Head of Department. She has produced for children more than 75 YouTube (online) videos on Computer Science and Programming - and has had more than 12,000 hits globally.",
        "country": "United Kingdom",
        "avatar": "img/speakers/female.png",
        "links": {
        }
    },
    {
        "name": "Marek Greško",
        "bio": "Vyštudoval informatiku na fakulte STU. Má za sebou viac ako 10-ročnú prax v oblasti analýzy a vývoja SW a niekoľkoročné skúsenosti s vedením veľkých tímov. Podieľal sa na významných projektoch v nadnárodných ﬁnančných a telekomunikačných spoločnostiach. Oblasti IT freelancingu sa venuje viac ako 19 rokov a je jeden zo zakladateľov TITANS freelancers, kde v súčasnosti pôsobí na pozícii CEO.",
        "country": "Slovakia",
        "avatar": "img/speakers/marek_gresko.jpg",
        "links": {
            "link": "https://www.titans.sk/"
        }
    },
    {
        "name": "Hannah Hazi",
        "bio": "I am an Engineer based in Cambridge, UK. I currently work at Stratasys as a C++, Python and Typescript developer, working on tools to support our GrabCAD Print software. In my spare time I love tinkering with Raspberry Pi and playing complicated board games.",
        "country": "United Kingdom",
        "avatar": "img/speakers/female.png",
        "links": {
        }
    },
    {
        "name": "Adam Števko",
        "bio": "Adam is currently working as Senior Security Engineer in Glovo, where he works hard to protect the company assets from threats and integrates security everywhere possible. He held many positions over his career where he dealt with lot of problems when building high available media systems and networks both on-premise and in the cloud. On his journey, he also helped teams of developers to automate application and infrastructure deployments. He is a UNIX Lover, devoted Python user, tech enthusiast and OSS contributor. His interests range from operating systems, networking and especially security.",
        "country": "Slovakia",
        "avatar": "img/speakers/adam_stevko.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/xenol/"
        }
    },
    {
        "name": "Luka Raljević",
        "bio": "I have 10 years of experience in web development, mostly with Python.\nI have made right choices, wrong choices and had to maintain someone else’s choices.\nI have built simple and complex web applications from scratch, took over complex systems, endured countless upgrades and dependency changes.\nI started as a fullstack developer and system administrator. I have been a team lead, a mentor and a software architect. However, I was always, first and foremost, a developer.",
        "country": "Croatia",
        "avatar": "img/speakers/luka_raljevic.jpg",
        "links": {
        }
    },
    {
        "name": "Anton Caceres",
        "bio": "Anton is a developer running own software agency in Munich. He is known as a Python community activist and organizer of the PyConWeb conference, for which he was recognized as a Python Software Foundation Fellow. Anton prefers weird ways to get to the conferences and often makes pointless lightning talks about that.",
        "country": "Ukraine",
        "avatar": "img/speakers/anton_caceres.jpg",
        "links": {
        }
    },
    {
        "name": "Michal Brandis",
        "bio": "Vyštudoval telekomunikácie na FEI STU BA. Ako freelancer na trhu pôsobí už viac ako 5 rokov. Má za sebou niekoľkoročnú prax ako IT Application Support Specialist, ktorú získal prácou na viacerých veľkých projektoch. Posledné 2 roky pôsobí v TITANS freelancers na pozícií Account Manager so špecializáciou na Cloud, Big data a Python pozície. Zastrešuje výber tých najlepších IT špecialistov pre viac ako 100 projektov ročne a denne komunikuje s vedúcimi zástupcami mnohých veľkých firiem na Slovensku i v zahraničí.",
        "country": "Slovakia",
        "avatar": "img/speakers/michal_brandis.jpg",
        "links": {
            "link": "https://www.titans.sk/"
        }
    },
    {
        "name": "Ján Šichula",
        "bio": "Momentálne pracujem ako lektor v STEP IT Academy Bratislava, kde vyučujem široké spektrum predmetov. Z pohľadu záujmov mám najbližšie k technológiám, na ktorých beží web. Hlbšie v minulosti som sa venoval aj administrácii počítačových sietí na báze systému Windows. Do tejto škály záujmov som pribral aj Python a s nadšením objavil, ako sa dá krásne skombinovať s nástrojom Visual Studio Code.",
        "country": "Slovakia",
        "avatar": "img/speakers/jan_sichula.jpg",
        "links": {
            "facebook": "https://www.facebook.com/jan.sichula"
        }
    },
    {
        "name": "Goce Anastasovski",
        "bio": "Goce started working with Android in 2014 for alarm.com, a small security and home automation company, where he worked on an app that would let customers control various IoT devices, such as locks, garage doors, cameras, in their home. Since then, he has transitioned to a Mobile Tech Lead role at for the Video Team in Washington D.C. where he works closely with several Android and iOS engineers.\n\nIn his free time, you will find Goce traveling, cooking or learning a new spoken languages.",
        "country": "United States",
        "avatar": "img/speakers/goce_anastasovski.jpg",
        "links": {
            "facebook": "https://www.facebook.com/ganastasovski",
            "linkedin": "https://www.linkedin.com/in/anastasovski-goce/"
        }
    },
    {
        "name": "Věroš Kaplan",
        "bio": "Věroš used to be Dev but he is now working mainly as an Operationss guy.\n\nWhile looking for DevOps enlightenment, he keeps himself best by hacking with random things and products - from Kubernetes to MicroPython.",
        "country": "Czech Republic",
        "avatar": "img/speakers/veros_kaplan.jpg",
        "links": {
            "link": "https://veroskaplan.cz/"
        }
    },
    {
        "name": "Mauro Pelucchi",
        "bio": "He received a Bachelor's degree in Informatics Engineering from the University of Bergamo (Italy) in 2016 with a thesis on \"Answering queries on Open Data\".\nIn 2016/2017, He has attended the Master Business Intelligence and Big Data Analytics at the University of Milano-Bicocca.\nHe works as Data Scientist and Data Engineer: designing and deploying large databases, extracting recurring patterns from unstructured data, applying machine learning techniques to classify and summarize data, realizing decision support systems and data visualization tools.\nIn the past, he has designed and developed Process Integration and Business Intelligence systems for large industries and public administrations.\nHis main research interests are OpenData and Open Government, Big Data Analysis, Data Presentation Techniques,\nArtificial Intelligence and Machine Learning and Deep Learning Modeling.\nFrom 2017, He collaborates with University of Milano-Bicocca as a lecturer at Master \nBusiness Intelligence and Big Data Analytics and with European Union as panelist and expert in Big Data and Machine Learning Conference.",
        "country": "Italy",
        "avatar": "img/speakers/mauro_pelucchi.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/mauropelucchi/",
            "link": "http://www.mauropelucchi.com"
        }
    },
    {
        "name": "Dmitry Dygalo",
        "bio": "I am a team lead at kiwi.com in Prague. I started with Python in 2010 as a hobby during the university, then switched to a fulltime developer job after graduation. I love writing tests and cares about code maintainability. My hobbies are open source and traveling.",
        "country": "Czech Republic",
        "avatar": "img/speakers/dmitry_dygalo.jpg",
        "links": {
            "github": "https://github.com/Stranger6667",
            "twitter": "https://twitter.com/Stranger6667"
        }
    },
    {
        "name": "Brendan Maginnis",
        "bio": "Brendan is the cofounder of Sourcery, a startup who have just released their first product, a tool for automatically refactoring Python using AI.\n\nSourcery's goal is to help everyone write clean and simple code.",
        "country": "United Kingdom",
        "avatar": "img/speakers/brendan_maginnis.jpg",
        "links": {
            "link": "https://sourcery.ai/"
        }
    },
    {
        "name": "Peter Dolák",
        "bio": "Contributing to Exponea's core product mostly as a backend developer in Python, Go and C++ for over 5 years since finishing studies at Computer Science at FMFI UK BA, helping Exponea to become one of the leaders in the CDP and Marketing Cloud market. Have developed many other for-profit and non-profit web applications, with the most popular one having been used by over 100k registered users across the globe.",
        "country": "Slovakia",
        "avatar": "img/speakers/peter_dolak.jpg",
        "links": {
            "link": "https://exponea.com/"
        }
    },
    {
        "name": "Ondrej Sika",
        "bio": "Jsem DevOps engineer and konzultant z Prahy. Pomáhám firmám zavádět a zlepšovat DevOps, aby zefektivnili proces vývoje, automatizovali nasazování software a zvýšili stabilitu při jeho provozování.",
        "country": "Czech Republic",
        "avatar": "img/speakers/ondrej_sika.jpg",
        "links": {
            "link": "https://ondrejsika.com/"
        }
    },
    {
        "name": "Michal Petrucha",
        "bio": "Michal is a Pythonista at heart who started using the language back in high school, and never really found another one that could take its place.\nGenerally involved in server-side back-end work, enjoying some lower level systems programming and networking on occasion, also interested in security. Out in the real world, a crazy homebrewing experimenter, vegetable fermenter, heavy music aficionado, and martial artist.",
        "country": "Slovakia / Sweden",
        "avatar": "img/speakers/michal_petrucha.jpg",
        "links": {
            "twitter": "https://twitter.com/koniiiik",
            "link": "http://koniiiik.org"
        }
    },
    {
        "name": "Conor Lyman",
        "bio": "Conor Lyman is a modeling engineer at Blueprint Power, a company that provides real-estate owners with new revenue streams by transforming their buildings into power plants connected to new energy markets. Since joining the modeling team in the beginning of 2019, Conor has developed a suite of descriptive, predictive, and proscriptive models that distill the complicated world of energy markets into a production-ready platform for automated market participation. Beyond the core model development, Conor is dedicated to ensuring the models are scalable for new markets and customers and to growing Blueprint’s Modeling and Simulation team. Conor received a BS from The George Washington University in Mechanical Engineering with a minor in Sustainability and his previous experience includes work at both Google and Lockheed Martin’s Skunk Works. Outside of work, Conor enjoys playing and listening to music and maximizing his time outdoors.",
        "country": "United States",
        "avatar": "img/speakers/conor_lyman.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/conor-lyman-2a09278b/",
            "link": "https://www.blueprintpower.com/"
        }
    },
    {
        "name": "William Galindez Arias",
        "bio": "Born and raised in Colombia, studied Electronic Engineering specialized in Digital Electronics, former exchange student in Czech Technical University in the faculty of Data Science. Started professional career working in Intel as Field Engineer and Oracle as Solution Architect in Colombia. After some years in the industry became a student again in Prague (CZ) in the field of Machine Learning,  jumped back to Enterprise Software industry as  Solution Architect in CA Technologies for Europe. Currently performs as advisor of Colombian Startup focused in building NLU Chatbots and Web Applications  and at the same time works as Engineer in French Company developing Bots for automation.",
        "country": "Colombia",
        "avatar": "img/speakers/william_galindez_arias.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/william-galindez-arias-87566542/",
            "twitter": "https://twitter.com/WilliamAriasZ"
        }
    },
    {
        "name": "Adrian Gonzalez Martin",
        "bio": "Adrian is a Machine Learning Engineer at Seldon, where his focus is to extend Seldon’s open source and enterprise machine learning operation products to solve large scale problems at leading organisations in the Automotive, Pharmaceutical and Technology sectors. When he is not doing that, Adrian loves experimenting with new technologies and catching up with ML papers. Before Seldon, Adrian has worked as a Software Engineer across different startups, where he contributed and led the development of large production codebases. Adrian holds an MSc in Machine Learning from University College London, where he specialised in probabilistic methods applied to healthcare, as well as a MEng in Computer Science from the University of Alicante.",
        "country": "Spain",
        "avatar": "img/speakers/adrian_gonzalez-martin.jpg",
        "links": {
            "github": "https://github.com/SeldonIO/seldon-core",
            "twitter": "https://twitter.com/seldon_io",
            "link": "https://www.seldon.io/"
        }
    },
    {
        "name": "Radoslav Kokuľa",
        "bio": "Rado začínal ako LabVIEW programátor, neskôr prešiel na Python a Robot Framework. V oblasti testingu sa pohybuje už viac ako 15 rokov a momentálne pracuje vo firme Kistler ako Test Lead.",
        "country": "Slovakia",
        "avatar": "img/speakers/radoslav_kokula.jpg",
        "links": {
            "link": "http://www.kistler.com/"
        }
    },
    {
        "name": "Tibor Zavadil",
        "bio": "Expert in Data Science, Machine Learning, Textmining, Statistics and Economics with working experience from academia, (central) bank, (re-)insurance, AI startup, consultancy, entertainment and software engineering.",
        "country": "Slovakia",
        "avatar": "img/speakers/tibor_zavadil.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/tibor-zavadil-9823263/"
        }
    },
    {
        "name": "Martin Brezáni",
        "bio": "Martin je súčasťou AI tímu v PwC so zameraním na NLP a optimizačné problémy s použitím strojového učenia. Zaujíma sa o umelú inteligenciu a témy, ktoré by mohli byť v budúcnosti úzko späté s umelou inteligenciou. To zahŕňa aj tému kvantových počítačov s ich schopnosťou efektívne prehľadávať priestor nepolynomiálnych problémov.\n\nMartin is a part of the AI team in PwC, mostly focusing on NLP and optimization problems using Machine Learning. He is an enthusiast in AI and topics possibly connected to AI in future. This also includes quantum computers with their ability to effectively search through the space of non polynomial problems.",
        "country": "Slovakia",
        "avatar": "img/speakers/martin_brezani.jpg",
        "links": {
            "linkedin": "http://linkedin.com/in/martin-brezáni-bab37912a",
            "link": "https://www.pwc.com/sk/sk/"
        }
    },
    {
        "name": "Jiří Kozel",
        "bio": "Už 14 let mě baví a živí geoinformatika. Začal jsem jako zaměstnanec Masarykovy univerzity postupně na pozicích geoinformatik, vývojář, systémový analytik a nakonec vedoucí skupiny GIS na Ústavy výpočetní techniky. Dva roky jsem pro firmu MapTiler rozvíjel celosvětový projekt OpenMapTiles. Od roku 2016 pracuji naplno na volné noze.",
        "country": "Česká republika",
        "avatar": "img/speakers/jiri_kozel.jpg",
        "links": {
            "twitter": "https://twitter.com/jrkzl",
            "github": "https://github.com/jirik",
            "link": "https://jirikozel.cz"
        }
    },
    {
        "name": "Michal Chovanec",
        "bio": "Som výskumník v oblasti hlbokého učenia. Momentálne pracujem v Bratislave, vo firme Tachyum, kde riešim problematiku návhru procesora pre AI. PhD. som získal na Fakulte Riadenia a Infromatiky na Žilinskej univerzite - v téme reinforcement learning.\nVo voľnom čase chodím na hory, leziem, strieľam z luku a venujem sa bojovým umeniam.",
        "country": "Slovakia",
        "avatar": "img/speakers/michal_chovanec.jpg",
        "links": {
            "github": "https://github.com/michalnand"
        }
    },
    {
        "name": "Christopher Lozinski",
        "bio": "Christopher Lozinski is an MIT graduate, serial entrepreneur, dual US-EU citizen, and polyglot. Instead of seeking Venture Capital, he moved from Silicon Valley to Poland. He runs a number of interesting websites, which all use MQTT for chat. PythonLinks.info is a catalogue of the best Python lightning talks. StopSmog.info is a map of organizations fighting smog and climate change. ForestWiki.com is a distributed chat wiki.",
        "country": "Poland / United States",
        "avatar": "img/speakers/christopher_lozinski.jpg",
        "links": {
            "link": "https://PythonLinks.info",
            "link": "https://StopSmog.info",
            "link": "https://ForestWiki.com"
        }
    },
    {
        "name": "Nandor Poka",
        "bio": "PhD in Molecular Biology, MSc in Software Engineering. Working as Software Architect at Gerhardt Informatics. With insight into both areas Bioinformatics is a natural interest of mine.",
        "country": "Germany",
        "avatar": "img/speakers/nandor_poka.jpg",
        "links": {
            "twitter": "https://twitter.com/Nandor_Poka",
            "linkedin": "https://www.linkedin.com/in/nandor-poka/",
            "link": "https://www.xing.com/profile/Nandor_Poka/cv",
            "link": "https://np-bio.info",
            "link": "https://gerhardt.io/team/nandor"
        }
    },
    {
        "name": "Marcel Kucharik",
        "bio": "Marcel first encountered the field of bioinformatics on his master's studies in the Faculty of Mathematics, Physics, and Informatics (MatFyz) of the Comenius University in Bratislava. Soon after that, he went to the Vienna University for doctorate studies, where he finally get to know Python language. Currently, he works as a bioinformatician for Geneton company, where he develops new medical diagnoses mainly from sequencing genomic data. Python (with all its core routines (pandas, numpy, scikit-learn, ...) and libraries (dash, flask, restplus, ...) is his indispensable working tool in this field.",
        "country": "Slovakia",
        "avatar": "img/speakers/marcel_kucharik.jpg",
        "links": {
        }
    },
    {
        "name": "Matej Vetrak",
        "bio": "I am a Senior Infrastructure Engineer at Exponea where I follow my passion of exploring the latest open-source technologies. Writing microservices using Golang and Python, running on top of Kubernetes, monitored by Prometheus and Grafana while horribly failing with integrating Istio.",
        "country": "Slovakia",
        "avatar": "img/speakers/matej_vetrak.jpg",
        "links": {
            "link": "https://exponea.com/"
        }
    },
    {
        "name": "Craig Franklin",
        "bio": "Craig is a professional web developer by way of digital marketing and an amateur data scientist by way of wanting to understand what in the world all these numbers mean. Writing Ruby by day, his passion projects are centered around sports, data, and machine learning, all for the ultimate prize of bragging rights. Originally from the suburbs of Seattle, WA, he currently lives in Melbourne, Australia.",
        "country": "United States / Australia",
        "avatar": "img/speakers/craig_franklin.jpg",
        "links": {
        }
    },
    {
        "name": "Michal Haták",
        "bio": "Michal pracuje pres 8 let v Jihočeském Iniziu. Začínal s klasickými prezenčními weby, ale před pěti lety se mu do rukou dostal projekt pro zákazníka v Kanadě. Jedná se o automatizační platformu z prostředí Real Estate. Základy AUTOPROPu jsou v Pythonu a na AWS.",
        "country": "Česká republika",
        "avatar": "img/speakers/michal_hatak.jpg",
        "links": {
            "twitter": "https://twitter.com/Twistacz"
        }
    },
    {
        "name": "Jan Pipek",
        "bio": "Jan is a data scientist at DTOne by profession, physicist by education, co-organizer of PyData Prague meetups and PyLadies data course coach... and a year-long Python enthusiast.",
        "country": "Česká republika",
        "avatar": "img/speakers/jan_pipek.jpg",
        "links": {
            "twitter": "https://twitter.com/JanPipek",
            "github": "https://github.com/janpipek"
        }
    },
    {
        "name": "Andrej Krnáč",
        "bio": "Infrastructure & DevOps & Kubernetes Consultant at LabyrinthLabs\n\nHelping companies build, run, deploy and scale software and infrastructure by embracing the right technologies and principles.",
        "country": "Slovakia",
        "avatar": "img/speakers/andrej_krnac.jpg",
        "links": {
        }
    },
    {
        "name": "Martin Hauskrecht",
        "bio": "DevOps engineer at LabyrinthLabs\n\nPowering highly available applications on AWS using Kubernetes. Implementing DevOps and Infrastructure as Code principles.",
        "country": "Slovakia",
        "avatar": "img/speakers/martin_hauskrecht.jpg",
        "links": {
        }
    },
    {
        "name": "Mariana Hurná",
        "bio": "informatik, správca informačného systému mesta Prešov\nPísal sa rok 1996, doba, kedy sa mnohí z vás ešte len učili prvé písmenká alebo\nobjavovali kalkulačku. Presne toho roku sa Mariana Hurná začala starať o programy\na počítače na Mestskom úrade v Prešove. Vtedy na operačný systém bohate\npostačovalo 4 mega RAM, 80 mega na disku na 386 \nMariana Hurná buduje a rozširuje Integrovaný informačný systém samosprávy mesta\nPrešov od roku 2000. Ten v súčasnosti zahŕňa 80 modulov v dokumentačnom,\nadministratívnom, evidenčnom, ekonomickom, geografickom a e-Government\nsubsystéme pre viac ako 480 používateľov.\nPoznajúc procesy na úrade, kde sa zbiera a spracúva veľké množstvo informácií,\nktoré môžu byť veľmi zaujímavé pre verejnosť, mesto v roku 2012 zaviedlo\nautomatizovaný spôsob zverejňovania živých datasetov, prehľadov a vizualizácií\nv rozumnej štruktúrovanej forme s otvorenou licenciou na použitie.\nVarenie ako typický ženský koníček ovláda Mariana perfektne, akurát k tomu\npotrebuje dobrú klávesnicu a hrniec plný kvalitných dát. O receptoch, ako dať\nmestským dátam novú chuť a zmysel, bude jej prednáška.",
        "country": "Slovakia",
        "avatar": "img/speakers/mariana_hurna.jpg",
        "links": {
        }
    },
    {
        "name": "Fabšíková Nina",
        "bio": "To be announced...",
        "country": "Slovakia",
        "avatar": "img/speakers/female.png",
        "links": {
        }
    },
    {
        "name": "Iveta Ferčíková",
        "bio": "To be announced...",
        "country": "Slovakia",
        "avatar": "img/speakers/iveta_fercikova.jpg",
        "links": {
        }
    },
    {
        "name": "Martin Forstner",
        "bio": "Martin has been working as a Software Engineer for 11 years before he joined Redis Labs as a Solution Architect. He has developed server- and clientside solutions in several languages and paradigms. He's specialized in distributed systems programming using appropriate networking protocols and database technologies. In addition to that, he has been deploying applications in different cloud environments and was responsible for its smooth operation. He's a smooth operator!",
        "country": "Germany",
        "avatar": "img/speakers/martin_forstner.jpg",
        "links": {
        }
    }
]
