[
    {
        "name": "Tom Dyson",
        "bio": "Tom graduated from Balliol College, Oxford, in 1995, swapping the later philosophy of Wittgenstein for Netscape 2 and a 9600 baud modem. He ran a little agency called Naïve (“Why don’t you just call yourselves ‘Stupid’?”) until he joined forces with Olly in 2000, starting Torchbox with the aim of building beautiful online software for people who make the world a better place. As Technical Director, Tom is responsible for making sure the things we build are fast and reliable and easy to maintain. He manages the tech team and account directs many of our large technical projects. Along with Olly, Tom tries to make Torchbox a fun and inspiring place to work. Tom lives with his family in the countryside. He reads novels and gets cross at tennis. He plays in three bands who will probably never make it. He composed the theme tune to Charlie and Lola.",
        "country": "UK",
        "avatar": "img/speakers/tom_dyson.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/tomdyson/",
            "link": "https://torchbox.com/team/tom-dyson/"
        }
    },
    {
        "name": "Hannah Hazi",
        "bio": "I am an Engineer based in Cambridge, UK. I currently work at Stratasys as a C++, Python and Typescript developer, working on tools to support our GrabCAD Print software. In my spare time I love tinkering with Raspberry Pi and playing complicated board games.",
        "country": "UK",
        "avatar": "img/speakers/female.png",
        "links": {
        }
    },
    {
        "name": "Nicholas Thapen",
        "bio": "Nick is a founder of Sourcery, a startup that is using AI to help everyone write better code faster. He is a developer and architect with over a decade of experience in both academia and industry. He worked on machine learning and Twitter analytics at Imperial College London, and has also spent time as a developer and architect in the financial sector.",
        "avatar": "img/speakers/nick_thapen.png",
        "links": {
            "linkedin": "https://www.linkedin.com/in/nicholas-thapen/",
            "twitter": "https://twitter.com/nthapen",
            "link": "https://sourcery.ai/"
        }
    },
    {
        "name": "Roman Imankulov",
        "bio": "Roman is a software developer who started his career creating web apps with Django before it was cool. Eventually he sticks to Python for more than a decade, successfully using it as a golden hammer it to solve all kinds of problems. Originally Russian, at the moment he lives in Porto and works at Doist as head of the back-end development team.",
        "avatar": "img/speakers/roman_imankulov.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/roman-imankulov-91076144/",
            "twitter": "https://twitter.com/rdotpy",
            "github": "https://github.com/imankulov"
        }
    }
]