[
    {
        "name": "Tom Dyson",
        "bio": "Tom graduated from Balliol College, Oxford, in 1995, swapping the later philosophy of Wittgenstein for Netscape 2 and a 9600 baud modem. He ran a little agency called Naïve (“Why don’t you just call yourselves ‘Stupid’?”) until he joined forces with Olly in 2000, starting Torchbox with the aim of building beautiful online software for people who make the world a better place. As Technical Director, Tom is responsible for making sure the things we build are fast and reliable and easy to maintain. He manages the tech team and account directs many of our large technical projects. Along with Olly, Tom tries to make Torchbox a fun and inspiring place to work. Tom lives with his family in the countryside. He reads novels and gets cross at tennis. He plays in three bands who will probably never make it. He composed the theme tune to Charlie and Lola.",
        "country": "United Kingdom",
        "avatar": "img/speakers/tom_dyson.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/tomdyson/",
            "link": "https://torchbox.com/team/tom-dyson/"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "To be announced...",
                "text": "To be announced..."
            }
        ]
    },
    {
        "name": "Emilie Sengstschmid",
        "bio": "Emilie Sengstschmid is working as a software engineer at the University of Applied Arts Vienna. In 2016 she joined the Portfolio/Showroom project, whose main aim is to enable artists and scientists to announce, store and publish their own work and to exchange ideas with colleagues. Her responsibilities concern the entire development process from requirements engineering to deployment. She had worked on high performance applications at the Austrian Federal Computing Center before. She holds a bachelor's degree in Engineering.",
        "country": "Austria",
        "avatar": "img/speakers/emilie_sengstschmid.jpg",
        "links": {
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "Portfolio: How to build a flexible web application using controlled vocabularies and data schemes",
                "text": "The presentation of art works requires a very versatile and flexible web application. Artists use different media and presentation formats (exhibition, installation, performance, dance, music, etc.). Portfolio is a state-of-the-art research information system designed specifically for the needs of artists. Portfolio’s requirements included creating different and flexible object types which can be defined through a controlled vocabulary maintained by a special non-technical user group.\nPortfolio is built with Django. To fulfill the requirement of flexible and expandable object types a single PostgreSQL JSON database field is used to save object specific data. Data schemes for JSON serialized data are built with marshmallow, a library for simplified object serialization. Skosmos is used to publish, and provide a REST API for the controlled vocabulary which is maintained by non-technical users through VocBench, a web-based, collaborative development platform for managing SKOS thesauri. Portfolio provides a REST API for its Vue.js powered frontend and communication to other applications."
            }
        ]
    },
    {
        "name": "Roman Imankulov",
        "bio": "Roman is a software developer who started his career creating web apps with Django before it was cool. Eventually he sticks to Python for more than a decade, successfully using it as a golden hammer it to solve all kinds of problems. Originally Russian, at the moment he lives in Porto and works at Doist as head of the back-end development team.",
        "country": "Portugal",
        "avatar": "img/speakers/roman_imankulov.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/roman-imankulov-91076144/",
            "twitter": "https://twitter.com/rdotpy",
            "github": "https://github.com/imankulov"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "Evolution of a twelve-year-old project",
                "text": "Imagine a tool, created by a student in his free time to solve his personal needs. Chances are the lifetime of such project counts in weeks or months. Yet that's exactly how Todoist has been started in 2007. Fast forward, 12 years, and it's a successful project with millions of active users, active development and big plans ahead.\n\nI personally take care of Todoist since 2012, it's about 7 years. In his talk, I will share my challenges, wins failures, and things I learned working with the codebase."
            }
        ]
    },
    {
        "name": "Hannah Hazi",
        "bio": "I am an Engineer based in Cambridge, UK. I currently work at Stratasys as a C++, Python and Typescript developer, working on tools to support our GrabCAD Print software. In my spare time I love tinkering with Raspberry Pi and playing complicated board games.",
        "country": "United Kingdom",
        "avatar": "img/speakers/female.png",
        "links": {
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "The Knowledge In The Code: Or How I Learned to Stop Worrying and Love Legacy Code",
                "text": "Legacy code. It's old, poorly documented, barely tested, a nightmare to work with. You've never met the people who wrote it, but if you did you'd have a thing or two to tell them! If you had the time, you'd love to re-write it all.\n\nBut what if I told you that there are gems hidden in your company's old code? That re-writing it from scratch would be a bad mistake?\n\nThis is the story of how I learned to love legacy code. And how you might, too!\n\nThis talk is a revised and improved version of one I originally gave at PyCon UK, with more of an emphasis on what good refactoring can look like."
            }
        ]
    },
    {
        "name": "Michal Cyprian",
        "bio": "Michal works as a software engineer at Kiwi.com. Python is his language of choice since high school. He likes challenges, travelling and learning new things.",
        "country": "Slovakia",
        "avatar": "img/speakers/michal_cyprian.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/michal-cyprian-b5b915127/"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "How (not) to turn Kubernetes self-healing capabilities into self-destructive machinery",
                "text": "Kubernetes won the container orchestration war in 2017 and become the de facto standard for deploying containerized applications at scale. Many software projects, including Python projects, are being migrated to Kubernetes nowadays. The vision of a beautiful Cloud-native ecosystem powered by Kubernetes, where the smallest misbehavior of services is detected and everything scales automatically is very nice. However, the way to such an ecosystem can be longer and harder than it seems to be. What are the real challenges of migrating complex Python system to Kubernetes? What are the threats you should be aware of?\n\nThis talk summarizes the experience gained during the migration of booking, one of the most critical Python services at Kiwi.com, to Google Kubernetes Engine. Booking is a mixture of legacy services, new services based on Flask and asynchronous Celery tasks. I will be talking about our approach, our success, but also our failures and things we've learned the hard way."
            }
        ]
    },
    {
        "name": "Filipa Andrade",
        "bio": "I am a software engineer working mainly with python, django and recently with flask. I love programming, I enjoy developing a project from scratch but also I have fun debugging, fixing and refactoring legacy code. Currently my main interest in programming is writing readable and beautiful code, I believe you can't have one without the other.",
        "country": "Portugal",
        "avatar": "img/speakers/filipa_andrade.jpg",
        "links": {
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "Breaking stereotypes in tech",
                "text": "Like any other field, the tech world has many stereotypes, gender, ethnic or age stereotypes are fairly easy to spot. In this talk I will show you some of those stereotypes and present my ideas of where they come from. We will see why stereotypes are harmful, not only for the people involved but also for the tech world itself. I will share my personal perspective on how to break those stereotypes and open the way for more people to join our community."
            }
        ]
    },
    {
        "name": "Dom Weldon",
        "bio": "Dom Weldon is a Principal Software Engineer at decisionLab, a London-based mathematical modelling consultancy with expertise in machine learning, simulation, optimization and visualization. Dom's team specialize in taking models from data scientists and turning them into production ready tools. Current clients include the Royal Navy, Siemens and various UK public bodies.\n\nDom came to decisionLab from his PhD studies in Computational Geography at King's College London, his initial degree was in Natural Sciences at the University of Cambridge, and holds a master's in the historical and cultural geography of the Cold War United States. Outside of work, Dom is interested in languages and travelling, and holds a voluntary statutory appointment on a board monitoring the welfare and dignity of prisoners in a challenging North London jail.",
        "country": "United Kingdom",
        "avatar": "img/speakers/dom_weldon.jpg",
        "links": {
            "link": "https://www.decisionlab.co.uk/"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "Oxidizing MyPy: Typed Python, Rust and Rust-in-Python.",
                "text": "Python is a very readable, dynamically typed, interpreted, object oriented general purpose programming language that’s easy to learn, but offers almost unlimited power and flexibility to build almost whatever you want. However, as you go deeper into Python, some of the very features that made you fall in love with the language may start to limit what you can do: dynamic typing can make bugs hard to spot, large codebases can create a sea of objects, and the global interpreter lock (GIL) starts to impose a hard limit on performance. \n\nMeanwhile, Rust - a relatively new compiled systems programming language - is statically (and safely) typed, and offers and \"\"fearless\"\" concurrency without the limitations of the GIL; indeed, idiomatic Rust code runs at comparable speeds to C/C++. However, despite having a brilliant community, Rust is acknowledged as presenting a steep learning curve, and with so much Python being used in data science, academia, industry and beyond, switching entirely to Rust simply isn’t a sensible option for most teams. \n\nAt decisionLab, a mathematical modelling and data science consultancy based in central London, we wanted to improve our Python code quality and maintainability as much as possible, whilst also making use of the speed improvements that Rust could offer for some of our most performance critical algorithms.\n\nSo, we embraced typed Python, whilst also exploring Rust. So far, the effects on our code have been excellent. Not only did we spot bugs and improve our documentation using typed Python, but we were also able to use high level tools which leverage typed Python to build APIs and interfaces to our code and accelerate development. Best of all, using Rust from within our Python code was much easier than expected.\n\nThis talk will give a brief overview of typed Python, and how and why you would want to use it, alongside an overview of some excellent high-level tools that let your typed code fly. I'll also give an introduction to Rust the language, and the two major Rust-Python bindings: PyO3 and Rust-Python. We’ll then explore an example of how to write a Rust module and use it in Python.\n\nHopefully, I'll convince you that you don't need to be a computer science genius to work with a systems programming language, and that using Rust in your code doesn't require a complete re-write, but that you can actually start to swap-and-switch your code into Rust class by class, function by function.\n\nAt the same time, I'll reflect on the roles of Rust, Python and code generally in solving business problems. My aim in this talk is to show that Rust and Python are not enemies or competitors, but rather that they are different tools with different uses, and that when they are used in combination, great things can happen! In doing so, I'll offer my take on what I think the future of Rust is in Python."
            }
        ]
    },
    {
        "name": "Ines Meršak",
        "bio": "I hold a Master’s degree in mathematics and am currently a software developer at Bitstamp. I believe in writing and testing good software and am happiest when I get a lengthy peer review. I am also interested in data structures and algorithms and spend too much time playing RPGs (and too little time practising my guitar).",
        "country": "Slovenia",
        "avatar": "img/speakers/ines_mersak.jpg",
        "links": {
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "Pushing Django to its limit: rally of 2017",
                "text": "Cyptocurrencies first came about in 2009 with Bitcoin. Two years later, Bitcoin’s price has risen above a dollar and two young men decided to start a cryptocurrency exchange in their own garage in Slovenia, armed with 1000 EUR starting capital and some knowledge of Python and Django.\nToday, Bitstamp is the longest-standing exchange. Still running on Django, it had the most uptime (the site was unavailable for only half an hour) amongst all cryptocurrency exchanges in the rally of December 2017.\n\nIn this talk, I will introduce the most important part of any cryptocurrency exchange: trading. We will take a look at different order types, explain when a match happens and touch upon the logic of our old matching engine. We will talk about the problems legacy code has brought us, the improvements we’ve had to make to survive the rally and why we (trading team at Bitstamp) are now moving from Python to Go."
            }
        ]
    },
    {
        "name": "Nicholas Thapen",
        "bio": "Nick is a founder of Sourcery, a startup that is using AI to help everyone write better code faster. He is a developer and architect with over a decade of experience in both academia and industry. He worked on machine learning and Twitter analytics at Imperial College London, and has also spent time as a developer and architect in the financial sector.",
        "country": "United Kingdom",
        "avatar": "img/speakers/nick_thapen.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/nicholas-thapen/",
            "twitter": "https://twitter.com/nthapen",
            "link": "https://sourcery.ai/"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "Sourcery - Write better code faster with AI",
                "text": "Sourcery is a new tool designed to take the hard work out of refactoring.\nIt uses AI to search the space of possible changes to the code in search of improvements, backed up by extensive static analysis to prevent changes to functionality.\nFind out how Sourcery was made and what it can do."
            }
        ]
    },
    {
        "name": "Lilian Nandi",
        "bio": "Lilian studied Computer Science at high school and did her PhD in Computer Modelling from University College London. She went on to looking at computer applications and programming in the pharmaceutical sector before entering formal teaching for the next generation. She is currently engaged in teaching Python programming, C# and Javascript. She has given lectures in conferences both in the UK and abroad about the teaching of Computer Programming to young people. She has ran computer clubs including that of 'computer-assisted' investment for children and is a full member of the British Computer Society.\n\nLilian firmly believes that in this emergent brave new world, the Anthrpocene age, the computer (with its associated technologies) is the harbinger to transform globally man's short slavish existence to a better one - a world community defined by longer, richer and freer life experiences. She believes it is imperative that our schools empower our young children with his new knowledge, and Lilian herself did help reshape the Computer Science Department of an independent boys' school as Head of Department. She has produced for children more than 75 YouTube (online) videos on Computer Science and Programming - and has had more than 12,000 hits globally.",
        "country": "United Kingdom",
        "avatar": "img/speakers/female.png",
        "links": {
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "Creating the Next Generation of (Technology) Billionaires - Part 2",
                "text": "Our generation of young people in school (aged 5-18) have noticed the connection between Computer pRogramming, Technology & Success and Billionaires.On mass they are clamoring to master the skill of Computer pRogramming. We describe a successful working model for the teaching of Computer pRogamming.\n\nComputer Science is now regarded as one of the leading disciplines in the 21st century. Computers are ubiquitous and prevalent in most, if not all, sectors of our modern society – applications include using them in weather forecasting, robotic surgery, space exploration, e-commerce, smart cities, driverless cars, etc.\n\nTherefore, coding or computer programming is now regarded by many as an essential skill for the young person, and it has been dubbed the ‘4th’ R’ (computer pRogramming) along with Reading, wRiting and aRithmetic.\n\nIn recognition of the new status of computer programming, governments worldwide have launched initiatives to have it taught in schools from Kindergarten through to junior school and all the way through secondary school.\n\nSo, the question emerges is how do we best teach and motivate the next generation in acquiring this skill? Given the fact that this field is very much in its infancy, there are insufficient number of skilled Computer Science teachers and very little pedagogy to guide the educator. Therefore, the whole world is learning how best to teach this subject by trial and error.\n\nThe talk will describe a case study whereby coding/computer programming, in the form of Python programming, was introduced to a group of 110 young people from the ages of 11 to 18 (Years 7-13 in a U.K secondary school). The talk will include descriptions of the various teaching methodologies introduced to the young people for this purpose and the outcomes; the talk will also address various challenges and questions about how to teach coding to young people. The talk will conclude with helpful suggestions, based on the findings of the case study, on how to proceed with the teaching of computer programming to these people."
            }
        ]
    },
    {
        "name": "Adam Števko",
        "bio": "Adam is currently working as Senior Security Engineer in Glovo, where he works hard to protect the company assets from threats and integrates security everywhere possible. He held many positions over his career where he dealt with lot of problems when building high available media systems and networks both on-premise and in the cloud. On his journey, he also helped teams of developers to automate application and infrastructure deployments. He is a UNIX Lover, devoted Python user, tech enthusiast and OSS contributor. His interests range from operating systems, networking and especially security.",
        "country": "Slovakia",
        "avatar": "img/speakers/adam_stevko.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/xenol/"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "The day when I stopped worrying about exposed SSH ports",
                "text": "Everyone running workloads on EC2 in AWS had to design their own access solution at some point. Following the best practices, people tend to end up with a considerable infrastructure to maintain: few bastion hosts exposing ports to the network, optional VPN service for protecting exposed bastions hosts, user directory service for authentication and permissions management, some log aggregation solution for collecting access logs and SSH key management pain points.\n\nIn this talk, we will describe how can we liberate DevOps and Security teams from running and maintaining such access solution leveraging the power of serverless technologies and reusing already used products such as AWS IAM for permission management, AWS CloudTrail for logging and auditing user accesses, SSM Session Manager for accessing and granting access to instances and aws-gate, open source tool wrapping all aforementioned. With this approach, your teams really won’t need to ever worry about exposed SSH ports again."
            }
        ]
    },
    {
        "name": "Luka Raljević",
        "bio": "I have 10 years of experience in web development, mostly with Python.\nI have made right choices, wrong choices and had to maintain someone else’s choices.\nI have built simple and complex web applications from scratch, took over complex systems, endured countless upgrades and dependency changes.\nI started as a fullstack developer and system administrator. I have been a team lead, a mentor and a software architect. However, I was always, first and foremost, a developer.",
        "country": "Croatia",
        "avatar": "img/speakers/luka_raljevic.jpg",
        "links": {
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "Dive into codebase like a pro",
                "text": "How to get familiar with codebase you need to maintain with minimum suffering?\nHow to leave codebase easier to deal with for your colleagues so they don’t have to suffer like you did?\nIf you are experienced developer or a junior just starting your journey, inheriting codebase can be a very challenging task. Especially if the codebase is not quite up to your standards, or it’s just huge and complex beast.\nI will convey my experience and tips and tricks on inheriting code I acquired during 10 years of software development on new and old projects.\nThe talk will provide guidelines to ease taking over code from somebody else, as well as remind developers of the importance that planning, preparation and documentation have in facilitating code change and project growth."
            }
        ]
    },
    {
        "name": "Ján Šichula",
        "bio": "Momentálne pracujem ako lektor v STEP IT Academy Bratislava, kde vyučujem široké spektrum predmetov. Z pohľadu záujmov mám najbližšie k technológiám, na ktorých beží web. Hlbšie v minulosti som sa venoval aj administrácii počítačových sietí na báze systému Windows. Do tejto škály záujmov som pribral aj Python a s nadšením objavil, ako sa dá krásne skombinovať s nástrojom Visual Studio Code.",
        "country": "Slovakia",
        "avatar": "img/speakers/jan_sichula.jpg",
        "links": {
        },
        "abstracts": [
            {
                "type": "Workshop",
                "lang": "sk",
                "title": "Python a Visual Studio Code – motivácia, inštalácia, konfigurácia, používanie, skúsenosti",
                "text": "V STEP IT Academy Bratislava sme pri výuke jazyka Python v minulom roku nasadili ako vývojové prostredie Visual Studio Code. Veľmi som to uvítal, lebo Visual Studio Code som už predtým používal ako môj primárny vývojársky nástroj. I celkovo výsledný stav po nasadení hodnotím pozitívne a ako krok správnym smerom. Prednáška/workshop oboznámi poslucháčov s postupom ako nasadiť a používať kombináciu Pythonu a prostredia Visual Studia Code pod operačným systémom Windows. Po úvodnom popise základných čŕt Pythonu pod Windows a nástroja Visual Studio Code postúpime k opisu samotnej inštalácie a konfigurácie. Potom budeme demonštrovať niektoré typické postupy ako napr. otváranie nových projektov, funkciu IntelliSense či ladenie kódu. Prejdeme si aj popis architektúry celého riešenia s cieľom objasniť, ako je Python integrovaný s Visual Studio Code. Rovnako bude snaha spomenúť i niektoré skúsenosti z praxe."
            }
        ]
    },
    {
        "name": "Goce Anastasovski",
        "bio": "Goce started working with Android in 2014 for alarm.com, a small security and home automation company, where he worked on an app that would let customers control various IoT devices, such as locks, garage doors, cameras, in their home. Since then, he has transitioned to a Mobile Tech Lead role at for the Video Team in Washington D.C. where he works closely with several Android and iOS engineers.\n\nIn his free time, you will find Goce traveling, cooking or learning a new spoken languages.",
        "country": "United States",
        "avatar": "img/speakers/goce_anastasovski.jpg",
        "links": {
            "facebook": "https://www.facebook.com/ganastasovski",
            "linkedin": "https://www.linkedin.com/in/anastasovski-goce/"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "Code Review, A Software Engineer's Best Friend",
                "text": "One of the most powerful software quality tools are code reviews - an activity in which a developer, other than the author, examines a software deliverable for defects, and improvement opportunities. For a new Engineer, a code review can be a valuable learning resource, and for a more experienced Engineer it can be a good teaching mechanism when done properly. Whether you are a fresh college graduate, or a Senior Engineer with multiple years of experience under your belt, this talk will take you on the journey of a team that transformed their code review process from being vague and lacking, to being the biggest investment of their resulting, high quality code output. On this short journey we will specifically\nfocus on:\n\n- The importance of the human factor in code reviews.\n- The value of knowing who the review is for (understanding your audience).\n- What code reviews are and how they should be used effectively.\n- Best practices as well as General Do's and Don'ts.\n\n\nBy the end of this talk your perspective on code reviews should change and you will approach code reviews as what they really are - a Software Engineer's Best Friend (woof! woof!)"
            }
        ]
    },
    {
        "name": "Věroš Kaplan",
        "bio": "Věroš used to be Dev but he is now working mainly as an Operationss guy.\n\nWhile looking for DevOps enlightenment, he keeps himself best by hacking with random things and products - from Kubernetes to MicroPython.",
        "country": "Czech Republic",
        "avatar": "img/speakers/veros_kaplan.jpg",
        "links": {
            "link": "https://veroskaplan.cz/"
        },
        "abstracts": [
            {
                "type": "Workshop",
                "lang": "en",
                "title": "Python powered Digital clock",
                "text": "Build your own Python powered digital clock.\nOr display temperature. Or bitcoin price.\nOr play snake.\n\nWe are going to build  32x8 LED matrix and display messages over WiFi from desktop Python.\n\nYou should bring your laptop with installed Python."
            }
        ]
    },
    {
        "name": "Mauro Pelucchi",
        "bio": "He received a Bachelor's degree in Informatics Engineering from the University of Bergamo (Italy) in 2016 with a thesis on \"Answering queries on Open Data\".\nIn 2016/2017, He has attended the Master Business Intelligence and Big Data Analytics at the University of Milano-Bicocca.\nHe works as Data Scientist and Data Engineer: designing and deploying large databases, extracting recurring patterns from unstructured data, applying machine learning techniques to classify and summarize data, realizing decision support systems and data visualization tools.\nIn the past, he has designed and developed Process Integration and Business Intelligence systems for large industries and public administrations.\nHis main research interests are OpenData and Open Government, Big Data Analysis, Data Presentation Techniques,\nArtificial Intelligence and Machine Learning and Deep Learning Modeling.\nFrom 2017, He collaborates with University of Milano-Bicocca as a lecturer at Master \nBusiness Intelligence and Big Data Analytics and with European Union as panelist and expert in Big Data and Machine Learning Conference.",
        "country": "Italy",
        "avatar": "img/speakers/mauro_pelucchi.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/mauropelucchi/",
            "link": "www.mauropelucchi.com"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "Job-Me - An AI system to analyse resumes",
                "text": "Firms spend a lot of amounts of effort in terms of time and money to find the right profile for an open position.\nJob-Me is an innovative system to reduce such time and expenses by application of artificial intelligence (AI).\nThe idea is simple: apply text mining and others AI tecniques to parse text from resume, extract skills according\nto a standard classification system and measure the relevance of the skills for the profile."
            }
        ]
    },
    {
        "name": "Dmitry Dygalo",
        "bio": "I am a team lead at kiwi.com in Prague. I started with Python in 2010 as a hobby during the university, then switched to a fulltime developer job after graduation. I love writing tests and cares about code maintainability. My hobbies are open source and traveling.",
        "country": "Czech Republic",
        "avatar": "img/speakers/dmitry_dygalo.jpg",
        "links": {
            "github": "https://github.com/Stranger6667",
            "twitter": "https://twitter.com/Stranger6667"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "Stop writing tests for your web API! Try to generate them first",
                "text": "Having a comprehensive test suite is a crucial part of modern software development. But often, writing tests at scale is a tiresome and error-prone process.\n\nIn this talk, I will share thoughts and ideas about the applicability of property-based testing for web applications, show concrete examples and tools that will improve your test suites with minimal efforts.\nWe'll go through problems in testing that we are facing in Kiwi.com and the story behind Schemathesis - a tool that brings a popular Hypothesis testing library to the world of web applications."
            }
        ]
    },
    {
        "name": "Brendan Maginnis",
        "bio": "Brendan is the cofounder of Sourcery, a startup who have just released their first product, a tool for automatically refactoring Python using AI.\n\nSourcery's goal is to help everyone write clean and simple code.",
        "country": "United Kingdom",
        "avatar": "img/speakers/brendan_maginnis.jpg",
        "links": {
            "link": "https://sourcery.ai/"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "The Future of Software Development",
                "text": "AI is revolutionising everything it touches, and is of course written by software developers.\nWhat happens when we apply AI techniques to software development?\nWhat's the current state of the art, and where are things heading?"
            }
        ]
    },
    {
        "name": "Peter Dolák",
        "bio": "Contributing to Exponea's core product mostly as a backend developer in Python, Go and C++ for over 5 years since finishing studies at Computer Science at FMFI UK BA, helping Exponea to become one of the leaders in the CDP and Marketing Cloud market. Have developed many other for-profit and non-profit web applications, with the most popular one having been used by over 100k registered users across the globe.",
        "country": "Slovakia",
        "avatar": "img/speakers/peter_dolak.jpg",
        "links": {
            "link": "https://exponea.com/"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "This too shall parse",
                "text": "You used a parser the last time you ran any Python script. You created a simple parser the last time you wrote any regular expression. But when your program needs to understand languages that regexps just don't get, you may have to reach for a proper context-free parser. In this talk I will focus on the kind of problems that need such a parser, how to define artificial languages with grammars, what kinds of parsers there are and what are they suited for. I will also show off the Python parsing library \"lark\" and some cool stuff I made with it for Exponea - like our own query language."
            }
        ]
    },
    {
        "name": "Ondrej Sika",
        "bio": "Jsem DevOps engineer and konzultant z Prahy. Pomáhám firmám zavádět a zlepšovat DevOps, aby zefektivnili proces vývoje, automatizovali nasazování software a zvýšili stabilitu při jeho provozování.",
        "country": "Czech Republic",
        "avatar": "img/speakers/ondrej_sika.jpg",
        "links": {
            "link": "https://ondrejsika.com/"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "Monotorujte Vaši Python aplikaci pomocí Promethea",
                "text": "Prometheus je moderní monitoringový nástroj, který sbírá metriky z aplikaci a na jejich základě může posílat notifikace. Prometheus nativně podporuje monitoring Kubernetes, serverů, databázi a mnoho dalšího. Také může monitorovat metriky z Váší aplikace, díky kterým můžete ohdalit problémy v jejich zárodku. Pojďme si ukázat jak toho docílit v Pythonu za pomoci oficiálního Python klienta. Ukážeme si to na třech příkladech, aplikace v Djangu, ve Flasku a vlatni aplikaci v Pythonu."
            }
        ]
    },
    {
        "name": "Michal Petrucha",
        "bio": "Michal is a Pythonista at heart who started using the language back in high school, and never really found another one that could take its place.\nGenerally involved in server-side back-end work, enjoying some lower level systems programming and networking on occasion, also interested in security. Out in the real world, a crazy homebrewing experimenter, vegetable fermenter, heavy music aficionado, and martial artist.",
        "country": "Slovakia / Sweden",
        "avatar": "img/speakers/michal_petrucha.jpg",
        "links": {
            "twitter": "https://twitter.com/koniiiik",
            "link": "http://koniiiik.org"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "Autopsy of a serial burnout",
                "text": "Alright, let's be real, burnout is a thing. It's been talked enough about already at various conferences for us to know at least that much. And yet, the more bone-headed among us will look for any excuse to refuse admitting it to ourselves. Not even after it knocks us out two, three, four times. Not even after our doctor offers help. (I wish I was making this up.)\n\nHearing about this in abstract terms is useful, of course. Every talk drives a different point home. It only gets you so far, though. That's why I'm going to take another approach here – I want to tell my personal story as someone who grew up around the block, and try to make a post-mortem of several instances of burnout, so that you can avoid making the same mistakes that I did. Spoiler: we'll go as far back as high school.\n\nLuckily, in this case, the autopsy does not involve any actual death (that I know of)!"
            }
        ]
    },
    {
        "name": "William Galindez Arias",
        "bio": "Born and raised in Colombia, studied Electronic Engineering specialized in Digital Electronics, former exchange student in Czech Technical University in the faculty of Data Science. Started professional career working in Intel as Field Engineer and Oracle as Solution Architect in Colombia. After some years in the industry became a student again in Prague (CZ) in the field of Machine Learning,  jumped back to Enterprise Software industry as  Solution Architect in CA Technologies for Europe. Currently performs as advisor of Colombian Startup focused in building NLU Chatbots and Web Applications  and at the same time works as Engineer in French Company developing Bots for automation.",
        "country": "Colombia",
        "avatar": "img/speakers/william_galindez_arias.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/william-galindez-arias-87566542/",
            "twitter": "https://twitter.com/WilliamAriasZ"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "What if a Chatbot can become your language teacher?",
                "text": "How does a Colombian expat  living in Prague learn a notoriously difficult language? While going beyond dry lessons and into actually understanding how to hold conversations?  Discover the intersection between  people  and algorithms when it comes to learn words and meaning.  Join the discussion of how  leveraging recent state-of-the-art  NLP models (from RNN to Transformers) can have an impact in the way we learn, communicate and educate."
            }
        ]
    },
    {
        "name": "Adrian Gonzalez Martin",
        "bio": "Adrian is a Machine Learning Engineer at Seldon, where his focus is to extend Seldon’s open source and enterprise machine learning operation products to solve large scale problems at leading organisations in the Automotive, Pharmaceutical and Technology sectors. When he is not doing that, Adrian loves experimenting with new technologies and catching up with ML papers. Before Seldon, Adrian has worked as a Software Engineer across different startups, where he contributed and led the development of large production codebases. Adrian holds an MSc in Machine Learning from University College London, where he specialised in probabilistic methods applied to healthcare, as well as a MEng in Computer Science from the University of Alicante.",
        "country": "Spain",
        "avatar": "img/speakers/adrian_gonzalez-martin.jpg",
        "links": {
            "github": "https://github.com/SeldonIO/seldon-core",
            "twitter": "https://twitter.com/seldon_io",
            "link": "https://www.seldon.io/"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "Production Machine Learning with Seldon and MLflow",
                "text": "Deploying and managing machine learning models at scale introduces new complexities. Fortunately, there are tools that simplify this process. In this talk we walk you through an end-to-end hands on example showing how you can go from research to production without much complexity by leveraging the Seldon Core and MLflow frameworks. We will train a set of ML models, and we will showcase a simple way to deploy them to a Kubernetes cluster through sophisticated deployment methods, including canary deployments, shadow deployments and we’ll touch upon richer ML graphs such as explainer deployments."
            }
        ]
    },
    {
        "name": "Radoslav Kokuľa",
        "bio": "Rado začínal ako LabVIEW programátor, neskôr prešiel na Python a Robot Framework. V oblasti testingu sa pohybuje už viac ako 15 rokov a momentálne pracuje vo firme Kistler ako Test Lead.",
        "country": "Slovakia",
        "avatar": "img/speakers/radoslav_kokula.jpg",
        "links": {
            "link": "http://www.kistler.com/"
        },
        "abstracts": [
            {
                "type": "Workshop",
                "lang": "sk",
                "title": "Robot Framework: automatizované testy rýchlo a jednoducho",
                "text": "Robot framework je open source framework naprogramovaný v jazyku Python určený pre automatizáciu testov. Vďaka množstvu dostupných knižníc je možné využiť ho na testovanie rôznych druhov aplikácií a zariadení s využitím širokej škály rozhraní, protokolov a dátových typov. Počas workshopu si budú môct účastníci aj bez predošlých skúseností s týmto nástrojom prakticky vyskúšať vytváranie testov pre testovanie užívateľského rozhrania webovej aplikácie (pomocou Selenium knižnice) a testovanie backendu na úrovni REST API  rozhrania (HTTP protokol). Tutorial je zameraný na základy práce s Robot Frameworkom: základnú syntax, definovanie testovacích prípadov, definovanie setup a teardown procedúr, spušťanie testov a vyhodnotenie výsledkov vrátane test reportov."
            }
        ]
    },
    {
        "name": "Tibor Zavadil",
        "bio": "Expert in Data Science, Machine Learning, Textmining, Statistics and Economics with working experience from academia, (central) bank, (re-)insurance, AI startup, consultancy, entertainment and software engineering.",
        "country": "Slovakia",
        "avatar": "img/speakers/tibor_zavadil.jpg",
        "links": {
            "linkedin": "https://www.linkedin.com/in/tibor-zavadil-9823263/"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "Automation of data quality assessment from solar stations",
                "text": "To assess the photovoltaic (PV) potential of a specific site, stations measuring solar radiation are installed prior to the construction of a PV plant. Data from these stations are examined by quality control during which the erroneous data are removed from the assessment of the PV potential. The recognition of erroneous data is in many cases non-trivial, especially as the errors are hidden in changing weather conditions. Typical causes of erroneous data are e.g. shading, soiling, snow, dew and frost on the sensor. Nowadays, the quality assessment of the data is mainly performed by visual inspection and therefore must be done by domain-skilled data operator.\n\nThe poster will present to you, how by a combination of domain knowledge, agile process, statistics, machine learning, and Python such quality assessment can be automatized. Specifically, it will be shown, how all these areas are applied to automatically recognize the most usual issue – shading on the sensor by near and far objects. The poster will show you a real-world data example and will walk you through steps of algorithm which has a recall of 81.2% and a false-positive rate of 2.5%. Finally, the possibilities of improvements as well as the challenges and lessons learned will be also discussed.\n\nThe developed shading recognition algorithm described in the poster reduces the work of the domain data operator from hours to minutes. Moreover, it opens a possibility for customers to assess the data quality on their own without a need for a domain data operator. The combination of this automatic data quality control with existing vitalization and data-handling tools (all coded in Python) make this product unique on the market."
            }
        ]
    },
    {
        "name": "Martin Brezáni",
        "bio": "Martin je súčasťou AI tímu v PwC so zameraním na NLP a optimizačné problémy s použitím strojového učenia. Zaujíma sa o umelú inteligenciu a témy, ktoré by mohli byť v budúcnosti úzko späté s umelou inteligenciou. To zahŕňa aj tému kvantových počítačov s ich schopnosťou efektívne prehľadávať priestor nepolynomiálnych problémov.\n\nMartin is a part of the AI team in PwC, mostly focusing on NLP and optimization problems using Machine Learning. He is an enthusiast in AI and topics possibly connected to AI in future. This also includes quantum computers with their ability to effectively search through the space of non polynomial problems.",
        "country": "Slovakia",
        "avatar": "img/speakers/martin_brezani.jpg",
        "links": {
            "linkedin": "http://linkedin.com/in/martin-brezáni-bab37912a",
            "link": "https://www.pwc.com/sk/sk/"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "sk",
                "title": "Úvod do sveta kvantových počítačov",
                "text": "Po mnohé roky vnímame počítače ako stroje, ktoré nám pomáhajú svojimi algoritmami pri riešení najrôznejších problémov. V dobe, keď sú tranzistory malé a Mooreov zákon prestáva byť platný, je len malá nádej na efektívne riešenie tzv. nepolyminálnych problémov pomocou klasických počítačov. Jedno z možných riešení na prehľadávanie priestoru určitých problémov sú kvantové počítače pracujúce na báze qubitov. Ich efektivita oproti počítačom s klasickými bitmi je neporovnateľná. Napriek tomu sú kvantové počítače stále vo svojich začiatkoch a len málokto má tú možnosť fyzicky s nimi pracovať. Dnes však môžeme pracovať s kvantovými počítačmi z pohodlia nášho domova - pomocou python knižnice Qiskit vytvoriť kvantové obvody a poslať ich do jedného z niekoľkých reálnych kvantových počítačov. Výsledky z kvantového počítača pracujúceho až s 15 qubitmi tak môže získať ktokoľvek. A to je len začiatok novej, stále neprebádanej éry."
            }
        ]
    },
    {
        "name": "Jiří Kozel",
        "bio": "Už 14 let mě baví a živí geoinformatika. Začal jsem jako zaměstnanec Masarykovy univerzity postupně na pozicích geoinformatik, vývojář, systémový analytik a nakonec vedoucí skupiny GIS na Ústavy výpočetní techniky. Dva roky jsem pro firmu MapTiler rozvíjel celosvětový projekt OpenMapTiles. Od roku 2016 pracuji naplno na volné noze.",
        "country": "Česká republika",
        "avatar": "img/speakers/jiri_kozel.jpg",
        "links": {
            "twitter": "https://twitter.com/jrkzl",
            "github": "https://github.com/jirik",
            "link": "https://jirikozel.cz"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "A few times trapped by Celery",
                "text": "When I first heard about Celery three years ago, my first idea was \"Why would anyone call a tool for managing async tasks 'Salary'?\" Nowadays I am realizing that similar misunderstandings were actually quite often during my work with this tool.\n\nI want to talk about my experiences with Celery, from total beginner to a-few-times-trapped user. Together with my colleagues, we started with simple tasks that were periodically gathering data and computing aggregate values of timeseries within a research project. This was actually copybook example of Celery usage, with little bit of Celery beat and tasks chaining. Saturated with success, I decided to use Celery for Layman, a web service that publishes even large geospatial datasets through REST API. Redis as a broker, Flask as web application framework. There came need to effectively and safely abort running task. Or actually chain of tasks. And sometimes from different process than the one that started the chain. That's where thing got unexpectedly complicated and story of AbortableAsyncResult, persisting results and tracking task states starts."
            }
        ]
    },
    {
        "name": "Michal Chovanec",
        "bio": "Som výskumník v oblasti hlbokého učenia. Momentálne pracujem v Bratislave, vo firme Tachyum, kde riešim problematiku návhru procesora pre AI. PhD. som získal na Fakulte Riadenia a Infromatiky na Žilinskej univerzite - v téme reinforcement learning.\nVo voľnom čase chodím na hory, leziem, strieľam z luku a venujem sa bojovým umeniam.",
        "country": "Slovakia",
        "avatar": "img/speakers/michal_chovanec.jpg",
        "links": {
            "github": "https://github.com/michalnand"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "sk",
                "title": "deep reinforcement learning pomocou pytorch frameworku",
                "text": "Pytorch predstavuje silný nástroj pre ľudí precujúcich v oblasti deep learningu. Najčastejšie aplikácie sú z počítačového videnia, rozpoznávania textu a reči - rôzne úlohy klasifikácie alebo segmentácie.\n\nReinforcement learning (RL, učenie odmenou a trestom) predstavuje menej známi prístup. Bol to práve RL - program AlphaGO, ktorý v roku 2016 porazil svetového majstra v hre GO  a v roku 2019 pro-gamera v hre StarCraft (program AlphaStar).\n\nSpôsob učenia spočíva v hraní tisícok hier, získavania odmien a učenie sa z nich. Takýto agent je schopný hraním hry sám so sebou prekonať ľudských hráčov, aj \"\"hard coded\"\" botov.\n\nV prednáške ukážem základne myšlienky RL, ako vyzerá kód s použitím knižníc pytorch a aigym, ak nezabudnem, aj nejaké typy čo sa nedajú nájsť a čím sa trebalo popasovať - ono je pekné keď veci idú, ale keď nejdú je to ozaj boj ...\n\nPre nedočkavých prikladám video ako to pracuje : https://www.youtube.com/watch?v=rQIShnTz1kU\nA podobne aj kód (pre účely pyconu ale urobím menší repozitár) : https://github.com/michalnand/reinforcement_learning/tree/master/src\nkde budú jednoduhšie príklady a tréning sieti bude trvať len pár minút (namiesto pár dní)"
            }
        ]
    },
    {
        "name": "Christopher Lozinski",
        "bio": "Christopher Lozinski is an MIT graduate, serial entrepreneur, dual US-EU citizen, and polyglot. Instead of seeking Venture Capital, he moved from Silicon Valley to Poland. He runs a number of interesting websites, which all use MQTT for chat. PythonLinks.info is a catalogue of the best Python lightning talks. StopSmog.info is a map of organizations fighting smog and climate change. ForestWiki.com is a distributed chat wiki.",
        "country": "Poland / United States",
        "avatar": "img/speakers/christopher_lozinski.jpg",
        "links": {
            "link": "https://PythonLinks.info",
            "link": "https://StopSmog.info",
            "link": "https://ForestWiki.com"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "MQTT: For IoT, Cell Phones, Web and Chat\n\n",
                "text": "MQTT is an industry-standard pub/sub protocol for communicating between distributed processes. MQTT is great for IoT because it offers guaranteed message delivery even when a device is asleep or offline. MQTT is great for managing complexity, because it lets you organize communication as a taxonomy of topics.\n\nMQTT is an important technology because there may soon be more devices running MQTT than HTTP! Come to this lecture to learn the basics of MQTT, to find out if it is right for your application, and to get advice on which MQTT libraries and tools Python developers should use.\n\nThe speaker teaches MQTT Classes in Python, Javascript, GoLang and Erlang.\n\n\nHere are the talk slides: https://pythonlinks.info/presentations/MQTTTalk.pdf\n\nHere is a tree of chat rooms, one for every talk at PyCon USA. https://pythonlinks.info/pycon-usa/chat#children\n\nHere is the list of MQTT classes I am giving. https://pythonlinks.info/mqtt-lecture-and-tutorial"
            }
        ]
    },
    {
        "name": "Nandor Poka",
        "bio": "PhD in Molecular Biology, MSc in Software Engineering. Working as Software Architect at Gerhardt Informatics. With insight into both areas Bioinformatics is a natural interest of mine.",
        "country": "Germany",
        "avatar": "img/speakers/nandor_poka.jpg",
        "links": {
            "twitter": "https://twitter.com/Nandor_Poka",
            "link": "https://np-bio.info",
            "link": "https://gerhardt.io/team/nandor"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "en",
                "title": "Overview of Python for Bioinformatics and Computational Biology",
                "text": "Bioinformatics and Computational Biology are in the intersection of Biology, Data Science, Mathematics, and Informatics. The challenges, tasks, and not to mention the data, are as heterogeneous as life itself. One may have to do a de-novo assembly of a new strain of a pathogen, detect rare gene variants, build models for gene regulation, create interaction networks - the list is almost infinite.\n\nPython offers various specialized libraries and collections of tools for Bioinformatics and Computational Biology such as Biopython, Bioconda, PyBio and more. You can use these for example for read alignment, sequence alignment, variant calling, and other domain specific tasks. Often, these collections contain hundreds of tools, and overlaps in function may occur.\n\nFor more general, but typical tasks of these areas of science - eg. data cleaning, statistics, clustering, classification or image analysis -, one would need other packages available in the Python ecosystem. Typical choices are:\n\n    SciPy\n    scikit-learn / scikit-image\n    NumPy\n    Pandas\n    graph-tool\n    matplotlib\n\n.. and many more.\n\nIt's not easy to find what to use for a given problem, especially if you are new to either of the scientific fields, or Python itself. This talk will give short examples of typical bioinformatics ( including some more general) tasks and how to solve them using some of these tools.\nThe presentation is aimed at the novice-to-intermediate level, and no prior knowledge in Biology (and therefore in Bioinformatics and / or Computational Biology) is needed."
            }
        ]
    },
    {
        "name": "Marcel Kucharik",
        "bio": "Marcel first encountered the field of bioinformatics on his master's studies in the Faculty of Mathematics, Physics, and Informatics (MatFyz) of the Comenius University in Bratislava. Soon after that, he went to the Vienna University for doctorate studies, where he finally get to know Python language. Currently, he works as a bioinformatician for Geneton company, where he develops new medical diagnoses mainly from sequencing genomic data. Python (with all its core routines (pandas, numpy, scikit-learn, ...) and libraries (dash, flask, restplus, ...) is his indispensable working tool in this field.",
        "country": "Slovakia",
        "avatar": "img/speakers/marcel_kucharik.jpg",
        "links": {
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "sk",
                "title": "Ako mení Python svet biomedicíny",
                "text": "Momentálne zažívame veľký rozmach biomedicíny, spôsobený hlavne zlacnením a sprístupnením sekvenovania ľudského genómu pre širšie masy. Toto produkuje ohromné množstvá dát, ktoré treba automaticky spracovávať, uchovávať a hlavne odpovedať na diagnostické otázky. Širšia bioinformatická komunita používa na tieto účely Python kvôli jeho jednoduchosti, univerzálnosti a množstve knižníc, ktoré tento jazyk ponúka. V prezentácií prejdeme ako využívame Python v prenatálnom teste pre určenie pohlavia a genetických ochorení plodu dieťaťa už v 10.tom týždni tehotenstva. Od analýzy surových dát (biopython, pandas, numpy), cez automatizované spúšťanie vyhodnocovacích skriptov (snakemake), komunikáciu so serverom (flask, requests) až po reportovanie (WeasyPrint, html5lib) a vizualizovanie (matplotlib, seaborn, dash, plotly)."
            }
        ]
    },
    {
        "name": "Matej Vetrak",
        "bio": "I am a Senior Infrastructure Engineer at Exponea where I follow my passion of exploring the latest open-source technologies. Writing microservices using Golang and Python, running on top of Kubernetes, monitored by Prometheus and Grafana while horribly failing with integrating Istio.",
        "country": "Slovakia",
        "avatar": "img/speakers/matej_vetrak.jpg",
        "links": {
            "link": "https://exponea.com/"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "sk",
                "title": "Distributed Authorization at Scale",
                "text": "Authorization is an important part of every system. When you have a monolithic application it is relatively easy to create one common authorization layer that is used by the entire system and most engineers don’t have to worry about. But what if you are running a lot of different microservices that are written in multiple languages and communicating with different protocols? This was one of my tasks in the past year and I’d like to share with you our processes of thinking that lead us to develop a distributed system written in Golang using various open-source technologies, such as Open Policy Agent, Envoy Proxy or gRCP, while running everything on top of Kubernetes."
            }
        ]
    },
    {
        "name": "Michal Haták",
        "bio": "Michal pracuje pres 8 let v Jihočeském Iniziu. Začínal s klasickými prezenčními weby, ale před pěti lety se mu do rukou dostal projekt pro zákazníka v Kanadě. Jedná se o automatizační platformu z prostředí Real Estate. Základy AUTOPROPu jsou v Pythonu a na AWS.",
        "country": "Česká republika",
        "avatar": "img/speakers/michal_hatak.jpg",
        "links": {
            "twitter": "https://twitter.com/Twistacz"
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "cz",
                "title": "AWS Lambda - Serverless prakticky",
                "text": "V přednášce si ukážeme jak se pracuje se Serverless frameworkem a jak ho můžeme využít na svých projektech (ať už pro rychlá PoC a nebo v produkci)."
            }
        ]
    },
    {
        "name": "Zuzana Tkáčová",
        "bio": "Vyštudovala umelú inteligenciu na FEI TU v Košiciach. Učiteľka informatiky, t.č. pôsobí na Ústave informatiky PF UPJŠ, kde pripravuje a vedie kurzy pre učiteľov informatiky ZŠ a SŠ. Venuje sa didaktickým inováciám - aktivizujúcim a bádateľským metódam výučby informatiky, physical computingu, creative computingu, umelej inteligencii a prepájaniu informatiky a STE(A)M predmetov. Spolupracuje s občianskym združením Aj Ty v IT ako lektorka programátorských kurzov pre dievčatá a ženy.",
        "country": "Slovakia",
        "avatar": "img/speakers/zuzana_tkacova.jpg",
        "edusummit": true,
        "links": {
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "sk",
                "title": "Python ako nástroj pre STE(A)M problémy a úlohy",
                "text": "Výučba programovania nemusí byť limitovaná len tradičnými matematicko-logicky orientovanými úlohami. Reálny život a prepojenie na reálne technické, prírodovedné alebo umelecké témy prinášajú priestor pre nové nápady a aktívne zapojenie aj žiakov, ktorí nemajú k programovaniu prirodzene pozitívny postoj. Cieľom príspevku je ukázať Python nie ako nástroj na výučbu programovania (t.j. Python pre informatiku), ale nástroj pre riešenie prírodovedných, umeleckých a technických problémov v kontexte stredoškolskej informatiky (t.j. Python pre prírodné a technické vedy a umenie) a ako využívať jeho reálny potenciál na hodinách informatiky nad rámec tradičných \"programátorských\" úloh."
            }
        ]
    },
    {
        "name": "Peter Kučera",
        "bio": "Stredoškolský učiteľ informatiky, autor učebníc Pythonu\n\nPôsobí ako učiteľ informatiky na 1. súkromnom gymnáziu v Bratislave. Vytvoril sériu učebníc Programujeme v Pythone spolu s Príručkami pre učiteľa, maturitnou zbierkou úloh a zbierkou testov. Vedie Klub učiteľov informatiky. Realizuje školenia jazyka Python pre učiteľov. Na praxi pripravuje študentov učiteľstva informatiky (fakultný učiteľ FMFI UK).",
        "country": "Slovakia",
        "avatar": "img/speakers/peter_kucera.jpg",
        "edusummit": true,
        "links": {
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "sk",
                "title": "Programujeme v Pythone hardvér",
                "text": "Už niekoľko rokov s našimi študentmi programujeme v Pythone. Okrem klasického programovania ich najnovšie učíme programovať v jazyku Python aj hardvér. Má sa škola venovať programovaniu hardvéru? Aké to má výhody? Ako začať a čomu sa venovať? Podelíme sa s našimi skúsenosťami. Ukážeme vám, ako študenti vytvorili školskú meteostanicu, paličku pre nevidiacich či automatické zavlažovanie.\nV príspevku porovnáme skúsenosti s programovaním hardvéru a klasickým programovaním. Uvedieme, že programovanie hardvéru je komplexnejšia záležitosť. Okrem samotného programovania rozvíja i ďalšie zručnosti, učí systematicky hľadať chyby a tvorivo myslieť. Po zvládnutí základov považujeme za dôležité, aby študenti v tímoch vytvárali vlastné hardvérové projekty, čím učiteľ ustúpi do úzadia a prácu na získavaní poznatkov prevezmú žiaci. Darí sa nám takto organizovať vzdelávanie a povieme vám, ako na to."
            }
        ]
    },
    {
        "name": "Jaroslav Výbošťok",
        "bio": "Viac ako 13 rokov vyučuje informatiku a semináre z programovania pre maturantov na Gymnáziu Jura Hronca v Bratislave. Učil tiež na osemročnom gymnáziu na Bajkalskej v Bratislave a základnej škole v Detve. Je spoluautorom učebníc Programujeme v Pythone – druhý a tretí diel a Maturujeme v Pythone. Na praxi pripravuje študentov učiteľstva informatiky ako fakultný učiteľ FMFI UK.",
        "country": "Slovakia",
        "avatar": "img/speakers/jaroslav_vybostok.jpg",
        "edusummit": true,
        "links": {
        },
        "abstracts": [
            {
                "type": "Talk",
                "lang": "sk",
                "title": "Programovací jazyk Robot Karel po novom a online.",
                "text": "V mojom príspevku predstavím nové online prostredie a metodiku pre výučbu algoritmizácie prioritne pre druhý stupeň základných škôl. Prostredie a metodiku som vyvinul na základe mojich skúseností s vyučovaním na ZŠ a osemročnom gymnáziu. Založené je na známom koncepte programovania robota Karla v štvorcovej sieti. Spomeniem tiež praktické skúsenosti z výučby a reakcie žiakov pri programovaní Karla, ktoré mi pomohli pri ďalšom vývoji. Uvediem aj čo má táto prednáška spoločné s Pythonom a ako ma jazyk Python pri tvorbe inšpiroval."
            }
        ]
    }
]